Repository: Monviech/otobo-doc-otobo-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: pt_br, zh_hans

source: Any other modern web browser with JavaScript support
pt_br: Qualquer outro navegador moderno com suporte a JavaScript
zh_hans: 其他任何支持JavaScript的网络浏览器

source: Updating
pt_br: Atualizando
zh_hans: 更新

source: It is highly recommended to perform a test update on a separate testing machine first.
pt_br: É altamente recomendável realizar uma atualização de teste em uma máquina de teste separada primeiro.
zh_hans: 强烈建议先在单独的测试计算机上对更新进行测试。

source: Step 1: Stop All Relevant Services and the OTOBO Daemon
pt_br: Etapa 1: interromper todos os serviços relevantes e o OTOBO Daemon
zh_hans: 步骤 1：停用所有相关服务和OTOBO守护程序

source: Please make sure there are no more running services or cron jobs that try to access OTOBO. This will depend on your service configuration.
pt_br: Certifique-se de que não haja mais serviços em execução ou tarefas cron que tentem acessar o OTOBO. Isso dependerá da configuração do seu serviço.
zh_hans: 请确保没有其他正在运行的服务或cron作业，会尝试访问OTOBO的，当然这将取决于你对服务的配置。

source: Stop OTOBO cron jobs and the daemon (in this order):
pt_br: Pare os cron jobs do OTOBO e o daemon (nesta ordem):
zh_hans: 停用OTOBO cron作业和守护程序（按照这个顺序）：

source: Step 2: Backup Files and Database
pt_br: Etapa 2: Arquivos de backup e banco de dados
zh_hans: 步骤 2：备份文件和数据库

source: Create a backup of the hole ``/opt/otobo`` directory and the database.
pt_br: Crie um backup do diretório ``/opt/otobo`` e do banco de dados.
zh_hans: 为整个``/opt/otobo``目录和数据库创建备份。

source: Example for a standard installation with Ubuntu and MySQL
pt_br: Exemplo de instalação padrão com Ubuntu e MySQL
zh_hans: 一个标准的 Ubuntu 和 MySQL 的安装案例

source: Please check if all files are valid. Now we have a backup with all required data.
pt_br: Verifique se todos os arquivos são válidos. Agora temos um backup com todos os dados necessários.
zh_hans: 请检查是否所有文件都有效。现在我们已经拥有了所有需要的数据的备份。

source: Don't proceed without a complete backup of your system. You can use also the :ref:`backup-restore` script for this.
pt_br: Não continue sem um backup completo do seu sistema. Você também pode usar o script: :ref:`backup-restore` para isso.
zh_hans: 没有完整的系统备份，请勿继续。你也可以参考：`backup-restore`脚本。

source: Step 3: Install the New Release
pt_br: Etapa 3: instalar a nova versão
zh_hans: 步骤 3：安装新的版本

source: Download the latest otobo release from https://ftp.otobo.org/pub/otobo/. and unpack the source archive (for example, using ``tar``) into the directory ``/root/otobo-update``:
pt_br: Baixe a última versão do otobo em https://ftp.otobo.org/pub/otobo/. e descompacte o arquivo fonte (por exemplo, usando``tar``) dentro do diretório ``/root/otobo-update``:
zh_hans: 从https://ftp.otobo.org/pub/otobo/下载最新的OTOBO版本软件，打开封装文档（例如使用``tar``命令），并存到目录``/root/otobo-update``：

source: Restore Old Configuration Files
pt_br: Restaurar arquivos de configuração antigos
zh_hans: 恢复旧配置文件

source: We need only copy the file ``Kernel/Config.pm`` in OTOBO 10.
pt_br: Precisamos apenas copiar o arquivo ``Kernel/Config.pm` no OTOBO 10.
zh_hans: 在OTOBO 10中，我们只需要拷贝文件``Kernel/Config.pm`` 。

source: Restore Article Data
pt_br: Restaurar dados do artigo
zh_hans: 恢复物品数据

source: If you configured OTOBO to store article data in the file system you have to restore the ``article`` folder to ``/opt/otobo/var/`` or the folder specified in the system configuration.
pt_br: Se você configurou o OTOBO para armazenar dados do artigo no sistema de arquivos, você deve restaurar a pasta ``article`` para ``/opt/otobo/var/`` ou a pasta especificada na configuração do sistema.
zh_hans: 如果你对OTOBO配置，是将物品数据存储在文件系统中，则必须将``article`` 文件夹还原到``/ opt / otobo / var /``或系统配置中指定的文件夹。

source: Restore Already Installed Default Statistics
pt_br: Restaurar estatísticas padrão já instaladas
zh_hans: 恢复已经安装的默认统计信息

source: If you have additional packages with default statistics you have to restore the stats XML files with the suffix ``*.installed`` to ``/opt/otobo/var/stats``.
pt_br: Se você tiver pacotes adicionais com estatísticas padrão, você deve restaurar os arquivos XML de estatísticas com o sufixo ``*.installed`` para ``/opt/otobo/var/stats``.
zh_hans: 如果你还有其他带有默认统计信息的软件包，则必须将后缀为``*.installed`` 的XML统计数据文件恢复到/ opt / otobo / var / stats。

source: Set File Permissions
pt_br: Definir permissões de arquivo
zh_hans: 设置文件许可

source: Step 4: Update Installed Packages
pt_br: Etapa 4: Atualizar os pacotes instalados
zh_hans: 步骤 4：更新安装软件包

source: You can use the command below to update all installed packages. This works for all packages that are available from online repositories. You can update other packages later via the package manager (this requires a running OTOBO daemon).
pt_br: Você pode usar o comando abaixo para atualizar todos os pacotes instalados. Isso funciona para todos os pacotes disponíveis em repositórios online. Você pode atualizar outros pacotes mais tarde através do gerenciador de pacotes (isso requer um daemon OTOBO em execução).
zh_hans: 你可以使用下面的命令来更新所有已安装的软件包，这适用于在线存储库中可用的所有软件包。你也可以稍后通过操作系统中的软件包管理器更新其他程序包（这需要运行的OTOBO守护程序）。

source: Step 5: Start your Services
pt_br: Etapa 5: Inicie seus serviços
zh_hans: 步骤 5：开始你的服务

source: Now the services can be started. This will depend on your service configuration, here is an example:
pt_br: Agora os serviços podem ser iniciados. Isso vai depender da configuração do seu serviço, aqui está um exemplo:
zh_hans: 现在可以启动服务。这将取决于您的服务配置，下面是一个示例：

source: Now you can log into your system.
pt_br: Agora você pode entrar em seu sistema.
zh_hans: 现在你可以登陆到你的系统。

source: Updating a Docker-based Installation of OTOBO
pt_br: Atualizando uma instalação baseada em Docker do OTOBO

source: For running OTOBO under Docker we need the OTOBO software itself and an environment in which OTOBO can run. The OTOBO Docker image provides the environment and a copy of the OTOBO software. The software itself is installed in the volume *otobo_opt_otobo*. A named volume is used because run time data, e.g. configuration files and installed packages, is stored in the same directory tree.
pt_br: Para executar o OTOBO no Docker, precisamos do próprio software OTOBO e de um ambiente no qual o OTOBO possa ser executado. A imagem OTOBO Docker fornece o ambiente e uma cópia do software OTOBO. O próprio software é instalado no volume *otobo_opt_otobo*. Um volume nomeado é usado porque os dados de tempo de execução, por exemplo, arquivos de configuração e pacotes instalados, são armazenados na mesma árvore de diretório.

source: When updating to a new version of OTOBO several things have to happen.
pt_br: Ao atualizar para uma nova versão do OTOBO, várias coisas precisam acontecer.

source: The Docker Compose files have to be updated.
pt_br: Os arquivos Docker Compose devem ser atualizados.

source: The Docker Compose config file *.env* has to be checked.
pt_br: O arquivo de configuração *.env* do Docker Compose deve ser verificado.
zh_hans: 更改后的Docker Compose配置可以通过以下方式进行检查。

source: The new Docker image has to be fetched.
pt_br: A nova imagem do Docker deve ser buscada.

source: The volume *otobo_opt_otobo* must be updated.
pt_br: O volume *otobo_opt_otobo* deve ser atualizado.
zh_hans: ``docker volume inspect otobo_opt_otobo`` 检查一个卷。

source: Some maintainance tasks must be executed.
pt_br: Algumas tarefas de manutenção devem ser executadas.

source: In the sample commands below, the version **10.x.y**, corresponding to the tag **10_x_y**, is used as the example version. Please substitute it with the real version, e.g. **10.0.7**.
pt_br: Nos comandos de exemplos abaixo, a versão **10.x.y**, correspondente à tag **10_x_y**, é usada como a versão de exemplo. Substitua-o pela versão real, por ex. **10.0.7**.

source: These instructions apply only to OTOBO 10.0.6 or later.
pt_br: Estas instruções se aplicam apenas ao OTOBO 10.0.6 ou posterior.
zh_hans: 只有OTOBO 10.0.4或更高版本支持以下方法。

source: Updating the Docker Compose files
pt_br: Atualizar os arquivos Docker Compose
zh_hans: 5. 启动docker-compose映像

source: The OTOBO Docker Compose files can change between releases. Therefore is must be made sure that the correct setup is used.
pt_br: Os arquivos OTOBO Docker Compose podem mudar entre as versões. Portanto, deve-se ter certeza de que a configuração correta é usada.

source: See https://hub.docker.com/repository/docker/rotheross/otobo/tags for the available releases.
pt_br: Veja https://hub.docker.com/repository/docker/rotheross/otobo/tags os lançamentos disponíveis.

source: Checking the Docker Compose .env file
pt_br: Verificando o arquivo Docker Compose .env

source: The file *.env* controls the OTOBO Docker container. Within that file, the variables *OTOBO_IMAGE_OTOBO*, *OTOBO_IMAGE_OTOBO_ELASTICSEARCH*, and *OTOBO_IMAGE_OTOBO_NGINX* declare which images are used. The latest images are used when these variables are not set. If you want to use a specific version, then please set these variables accordingly.
pt_br: O arquivo *.env* controla o contêiner do Docker OTOBO. Nesse arquivo, as variáveis *OTOBO_IMAGE_OTOBO*, *OTOBO_IMAGE_OTOBO_ELASTICSEARCH*, e *OTOBO_IMAGE_OTOBO_NGINX* declaram quais imagens são usadas. As imagens mais recentes são usadas quando essas variáveis não são definidas. Se você quiser usar uma versão específica, defina essas variáveis de acordo.

source: Fetch the new Docker images
pt_br: Busque as novas imagens do Docker
zh_hans: 在Docker情况下

source: Docker compose can be used for fetching the wanted images from https://hub.docker.com/repository/docker/rotheross/.
pt_br: O Docker compose pode ser usado para buscar as imagens desejadas em https://hub.docker.com/repository/docker/rotheross/.

source: Update OTOBO
pt_br: Atualize o OTOBO

source: In this step the volume *otobo_opt_otobo* is updated and the following OTOBO console commands are performed:
pt_br: Nesta etapa, o volume *otobo_opt_otobo* é atualizado e os seguintes comandos do console OTOBO são executados:

source: The above listed commands can be automated. For that purpose the script *scripts/update.sh* will be made available in OTOBO 10.0.8. This script runs the commands, starting with the **docker-compose pull** command.
pt_br: Os comandos listados acima podem ser automatizados. Para tal, o script *scripts/update.sh* será disponibilizado no OTOBO 10.0.8. Este script executa os comandos, começando com o comando **docker-compose pull**.

source: Backup
zh_hans: 备份

source: Please read the Backup and Restore description :doc:`backup-restore` for base informations about the backup and restore scripts.
zh_hans: 请阅读备份和恢复的介绍文档：`backup-restore` 了解备份和恢复脚本的基本信息。

source: At the moment the Docker Compose environment is not tested in depth for production use. Please use the standard installation process for production use. Brave early adaptors are very welcome to share their experiences.
zh_hans: 在容器虚拟化环境没有在生产条件下完成测试的情况下，请按照标准安装流程安装生产应用，除非你很清楚自己每个步骤的所有结果。

source: Docker 19.03.13
zh_hans: Docker 19.03.08

source: Git 2.17.1
zh_hans: Git 2.25.1

source: The Docker images will eventually be fetched from the image repository https://hub.docker.com. But there are some setup and command files that need to be cloned from the *otobo-docker* Github repository. Make sure that you specify the branch that corresponds to the current version of OTOBO. For example, when *OTOBO 10.0.6* is the current version then please use the branch *rel-10_0_6*.
zh_hans: Docker映像最终将从https://hub.docker.com获取，但是需要从otobo-docker Github存储库中克隆一些设置和命令文件。请确保使用这些文件的合适版本，其中git标签必须对应OTOBO的版本，这里以OTOBO 10.0.4为例。

source: This manual had been published before OTOBO 10.0.4 was released. This means that the git label rel-10.0.4 might not exist yet.
zh_hans: 本手册已在OTOBO 10.0.4发布之前就出版了，这意味着git标签rel-10.0.4可能还不存在。

source: ``OTOBO_DB_ROOT_PASSWORD=<your_secret_password>``
zh_hans: ``OTOBO_DB_ROOT_PASSWORD``

source: **Docker Compose**
zh_hans: **docker-compose设置**

source: `Docker Compose quick start <http://mfg.fhstp.ac.at/development/webdevelopment/docker-compose-ein-quick-start-guide/>`_
zh_hans: `Docker Compose快速启动请参考 <http://mfg.fhstp.ac.at/development/webdevelopment/docker-compose-ein-quick-start-guide/>`_

source: `Newer version of Docker Compose on Ubuntu 18.04 LTS <https://www.digitalocean.com/community/tutorials/how-to-install-docker-compose-on-ubuntu-18-04>`_
zh_hans: `在Ubuntu 18.04 LTS上运行的Docker Compose更新版本请参考 <https://www.digitalocean.com/community/tutorials/how-to-install-docker-compose-on-ubuntu-18-04>`_

source: `Newer version of Docker on Ubuntu 18.04 LTS <https://www.digitalocean.com/community/tutorials/how-to-install-and-use-docker-on-ubuntu-18-04>`_
zh_hans: `在Ubuntu 18.04 LTS上运行的Docker更新版本请参考 <https://www.digitalocean.com/community/tutorials/how-to-install-and-use-docker-on-ubuntu-18-04>`_

source: `cleanup <https://forums.docker.com/t/command-to-remove-all-unused-images>`_
zh_hans: `清理： <https://forums.docker.com/t/command-to-remove-all-unused-images>`_

source: `Dockerfile best practices <https://www.docker.com/blog/intro-guide-to-dockerfile-best-practices/>`_
zh_hans: `Dockerfile 最佳实践： <https://www.docker.com/blog/intro-guide-to-dockerfile-best-practices/>`_

source: `Docker cache invalidation <https://stackoverflow.com/questions/34814669/when-does-docker-image-cache-invalidation-occur>`_
zh_hans: `Docker缓存失效：<https://stackoverflow.com/questions/34814669/when-does-docker-image-cache-invalidation-occur>`_

source: `Docker Host IP <https://nickjanetakis.com/blog/docker-tip-65-get-your-docker-hosts-ip-address-from-in-a-container>`_
zh_hans: `Docker主机IP地址： <https://nickjanetakis.com/blog/docker-tip-65-get-your-docker-hosts-ip-address-from-in-a-container>`_

source: `Environment <https://vsupalov.com/docker-arg-env-variable-guide/>`_
zh_hans: `环境： <https://vsupalov.com/docker-arg-env-variable-guide/>`_

source: `Self signed certificate <https://www.digitalocean.com/community/tutorials/how-to-create-a-self-signed-ssl-certificate-for-nginx-in-ubuntu-18-04>`_
zh_hans: `自己签名的证书：<https://www.digitalocean.com/community/tutorials/how-to-create-a-self-signed-ssl-certificate-for-nginx-in-ubuntu-18-04>`_

source: `Inspect failed builds <https://pythonspeed.com/articles/debugging-docker-build/>`_
zh_hans: `检查失败的创建 <https://pythonspeed.com/articles/debugging-docker-build/>`_

source: OTOBO is an open source ticket request system with many features to manage customer telephone calls and emails. It is distributed under the GNU General Public License (GPL) and tested on various Linux platforms.
zh_hans: OTOBO是一个开放源代码的工单管理系统，具有许多功能来管理客户的电话和电子邮件。它是根据GNU通用公共许可证（GPL）进行授权使用，并在各种Linux平台上进行了测试。

source: We supposed that OTOBO will be installed to ``/opt/otobo``. If you want to install OTOBO to a different directory, you have to change the path in the commands or create a symbolic link to this directory.
zh_hans: 我们认为OTOBO将被安装到``/ opt / otobo``。如果要将OTOBO安装到其他目录，则必须更改命令中的路径或创建指向该目录的符号链接。

source: Please start with installing the new OTOBO system to which your OTRS / ((OTRS)) Community Edition instance will then be migrated. We strongly recommend to read the :doc:`installation` chapter.
zh_hans: 请从安装新的OTOBO系统开始，将你的OTRS /（（OTRS））Community Edition迁移到该系统。这里我们强烈建议你先阅读：doc：ʻinstallation`。

source: Perform the step 3b for migrating to a Docker-based installation
zh_hans: 可以迁移到基于Docker的OTOBO 10

source: There are some specifics to be considered when your OTOBO installation is running under Docker. The most relevant: processes running in a Docker container generally cannot access directories outside the container. There is an exception though: directories mounted as volumes into the container can be accessed. Also, the MariaDB database running in ``otobo_db_1`` is not directly accessible outside the container network.
zh_hans: 如果Web应用程序OTOBO在容器“ otobo_web_1”中运行，则OTOBO通常无法访问容器外部的目录。但是有一个例外：可以访问作为卷装入到容器中的目录。这意味着迁移有两种可能。

source: Clustering
zh_hans: 集群

source: small CPU
zh_hans: 小CPU

source: 4 GB RAM
zh_hans: 4 GB 内存

source: 10 GB storage
zh_hans: 10 GB 存储空间

source: Apple Safari
zh_hans: 苹果 Safari

source: Google Chrome
zh_hans: 谷歌 Chrome

source: Microsoft Internet Explorer 11
zh_hans: 微软 Internet Explorer 11

source: Microsoft Edge
zh_hans: 微软 Edge

source: Updating a Docker-based installation of OTOBO
zh_hans: 可以迁移到基于Docker的OTOBO 10
