Repository: Monviech/otobo-doc-otobo-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: pt_br, zh_hans

source: First of all, you should install the database package. It is recommended to use the MySQL or MariaDB package, which will be delivered with your Linux system, but it is possible to use PostgreSQL or Oracle as well.
pt_br: Primeiro de tudo, você deve instalar o pacote de banco de dados. É recomendável usar o pacote MySQL ou MariaDB, que será entregue com o sistema Linux, mas é possível usar o PostgreSQL ou Oracle também.
zh_hans: 首先，你需要安装数据库软件。建议使用你的Linux系统自带的MySQL或者MariaDB，也可以使用PostgreSQL或者Oracle。

source: You'd typically do this from your systems package manager. Below you'll find the commands needed to set up MySQL on the most popular Linux distributions.
pt_br: Você normalmente faria isso no gerenciador de pacotes do sistema. Abaixo, você encontrará os comandos necessários para configurar o MySQL nas distribuições Linux mais populares.
zh_hans: 你可以通过系统的软件管理进行安装，下面是在常用的Linux版本上安装MySQL数据库的一些命令。

source: After installing the MySQL server you need configure it.
pt_br: Depois de instalar o servidor MySQL, você precisa configurá-lo.
zh_hans: 安装了MySQL服务器后，需要进行配置。

source: In MySQL higher or equal version 5.7 a new authentication module is active, and it is not possible to use the OTOBO web installer for database creation. Please login to the mysql console and set a different authentication module and password for the user ``root`` if this is the case:
pt_br: Na versão 5.7 ou superior do MySQL, um novo módulo de autenticação está ativo e não é possível usar o instalador da web OTOBO para criação de banco de dados. Por favor, faça login no console do mysql e defina um módulo de autenticação e senha diferentes para o usuário ``root``, se este for o caso:
zh_hans: 在MySQL 5.7及更高版本中，激活了一个新的认证模块，这样就不能用OTOBO的网络安装软件建立数据库了。这种情况下， 请登陆进入MySQL控制台，设置不同的认证模块和用户``root`` 的密码：

source: For MariaDB > 10.1 use instead the following command:
pt_br: Para MariaDB > 10.1, use o seguinte comando:
zh_hans: 对MariaDBM 10.1以上版本，用下面的命令：

source: If this command not work, please try the following commands:
pt_br: Se este comando não funcionar, tente os seguintes comandos:
zh_hans: 如果此命令不起作用，请尝试以下命令：

source: After OTOBO installation it is possible to change the authentication module again, if needed.
pt_br: Após a instalação do OTOBO, é possível alterar o módulo de autenticação novamente, se necessário.
zh_hans: 在OTOBO完成安装后，在需要时也可以更改认证模块。

source: The following configuration settings are minimum requirements for MySQL setups. Please add the following lines to the MySQL Server configuration file ``/etc/my.cnf``, ``/etc/mysql/my.cnf`` or ``/etc/mysql/mysql.conf.d/mysqld.cnf`` under the ``[mysqld]`` section:
pt_br: As seguintes definições de configuração são requisitos mínimos para as configurações do MySQL. Por favor, adicione as seguintes linhas ao arquivo de configuração do MySQL Server ``/etc/my.cnf``,``/etc/mysql/my.cnf`` ou ``/etc/mysql/mysql.conf.d/mysqld.cnf`` abaixo da seção ``[mysqld]``:
zh_hans: 下面的配置设定是MySQL安装的最低要求。请将下面的脚本加入``[mysqld]`` 下面的MySQL服务器配置文件``/etc/my.cnf``，``/etc/mysql/my.cnf`` 或者 ``/etc/mysql/mysql.conf.d/mysqld.cnf``：

source: For MySQL prior to MySQL 8.0 the query cache size should also be set:
pt_br: Para o MySQL anterior ao MySQL 8.0, o tamanho do cache da consulta também deve ser definido:
zh_hans: 对MySQL 8.0之前的版本，查询缓存尺寸需要设定：

source: Also add the following lines to the MySQL Server configuration file ``/etc/my.cnf``, ``/etc/mysql/my.cnf`` or ``/etc/mysql/mysql.conf.d/mysqldump.cnf`` under the ``[mysqldump]`` section:
pt_br: Além disso, adicione as seguintes linhas ao arquivo de configuração do servidor MySQL ``/etc/my.cnf``, ``/etc/mysql/my.cnf`` ou ``/etc/mysql/mysql.conf.d/mysqldump.cnf`` debaixo da seção ``[mysqldump]``:
zh_hans: 下面的配置设定是MySQL安装的最低要求。请将下面的脚本加入``[mysqld]`` 下面的MySQL服务器配置文件``/etc/my.cnf``，``/etc/mysql/my.cnf`` 或者 ``/etc/mysql/mysql.conf.d/mysqld.cnf``：

source: For production purposes we recommend to use the tool ``mysqltuner`` to find the perfect setup. You can download the script from github ``https://github.com/major/MySQLTuner-perl`` or install it on Debian or Ubuntu systems via package manager:
pt_br: Para fins de produção, recomendamos usar a ferramenta ``mysqltuner`` para encontrar a configuração perfeita. Você pode fazer o download do script no github ``https://github.com/major/MySQLTuner-perl`` ou instalá-lo nos sistemas Debian ou Ubuntu através do gerenciador de pacotes:
zh_hans: 出于生产率考虑，我们建议用``mysqltuner`` 工具实现优化。你可以从Github ``https://github.com/major/MySQLTuner-perl``下载脚本，或者通过软件管理在Debian或Ubuntu系统上安装：

source: After installing execute the script:
pt_br: Após a instalação execute o script:
zh_hans: 安装后运行下面的脚本：

source: Step 8: Setup Elasticsearch
pt_br: Passo 8: Configurar Elasticsearch
zh_hans: 步骤8：安装Elasticsearch弹性搜索

source: OTOBO recommends an active installation of Elasticsearch for quick search. The easiest way is to setup Elasticsearch on the same host as OTOBO and binding it to its default port.
pt_br: A OTOBO recomenda uma instalação ativa do Elasticsearch para pesquisa rápida. A maneira mais fácil é configurar o Elasticsearch no mesmo host que o OTOBO e vinculá-lo à sua porta padrão.
zh_hans: OTOBO建议活性安装Elasticsearch以便快速搜索，最简单的办法就是将Elasticsearch和OTOBO安装在一台主机上，并绑定默认端口。

source: Elasticsearch installation example based on Ubuntu 18.04 LTS
pt_br: Exemplo de instalação do Elasticsearch baseado no Ubuntu 18.04 LTS
zh_hans: 基于Ubuntu 18.04 LTS的Elasticsearch安装范例

source: JDK Installation
pt_br: Instalação do JDK
zh_hans: JDK安装

source: Elasticsearch Installation
pt_br: Instalação do ElasticSearch
zh_hans: Elasticsearch安装

source: Elasticsearch Installation on another Linux distribution
pt_br: Instalação do ElasticSearch em outra distribuição Linux
zh_hans: 在其他Linux版本中的Elasticsearch安装

source: Please follow the installation tutorial found at https://www.elastic.co/guide/en/elasticsearch/reference/current/setup.html.
pt_br: Siga o tutorial de instalação encontrado em https://www.elastic.co/guide/en/elasticsearch/reference/current/setup.html.
zh_hans: 请遵照 https://www.elastic.co/guide/en/elasticsearch/reference/current/setup.html中的安装教程进行。

source: Elasticsearch Module Installation
pt_br: Instalação do Módulo do ElasticSearch
zh_hans: Elasticsearch模块安装

source: Additionally, OTOBO requires plugins to be installed into Elasticsearch:
pt_br: Além disso, o OTOBO exige a instalação de plug-ins no Elasticsearch:
zh_hans: 另外，OTOBO需要在Elasticsearch上安装插件：

source: Elasticsearch Configuration
pt_br: Configuração do Elasticsearch
zh_hans: Elasticsearch配置

source: Elasticsearch has a multitude of configuration options and possibilities.
pt_br: O Elasticsearch possui diversas opções e possibilidades de configuração.
zh_hans: Elasticsearch的配置有很多选择和可能。

source: In order to ensure error-free operation, you should adjust the jvm heap space for larger OTOBO systems. Please adjust the settings in the file ``/etc/elasticsearch/jvm.options``. You should always set the min and max JVM heap size to the same value. For example, to set the heap to 4 GB, set:
pt_br: Para garantir uma operação livre de erros, você deve ajustar o espaço de heap da jvm para sistemas OTOBO maiores. Por favor, ajuste as configurações no arquivo ``/etc/elasticsearch/jvm.options``. Você sempre deve definir o tamanho mínimo e máximo do heap da JVM para o mesmo valor. Por exemplo, para definir o heap como 4 GB, defina:
zh_hans: 为了确保无故障运行，你需要调整大型OTOBO系统的jvm堆空间尺寸。这个配置在文件``/etc/elasticsearch/jvm.options``中进行调整。一定要吧JVM堆空间的最大和最小值设置为同一个，例如都设为4GB，设置：

source: In our tests, a value between 4 and 10 GB for medium-sized installations has proven to be the best.
pt_br: Em nossos testes, um valor entre 4 e 10 GB para instalações de tamanho médio provou ser o melhor.
zh_hans: 在我们的测试中，对于中型安装，这个值设为4-10GB是最好的。

source: See ``https://www.elastic.co/guide/en/elasticsearch/reference/current/heap-size.html`` for more information.
pt_br: Veja ``https://www.elastic.co/guide/en/elasticsearch/reference/current/heap-size.html`` para mais informações.
zh_hans: 请遵照 https://www.elastic.co/guide/en/elasticsearch/reference/current/setup.html中的安装教程进行。

source: Now you can restart your Elasticsearch server to load the new configuration settings. On most systems you can use the following command to do so:
pt_br: Agora você pode reiniciar o servidor da web para carregar as novas definições de configuração. Na maioria dos sistemas, você pode usar o seguinte comando para fazer isso:
zh_hans: 现在你可以重启你的Elasticsearch服务器，以便新的配置生效。对于大部分系统，可以用下面的命令实现：

source: Step 8: Basic System Configuration
pt_br: Passo 8: Configurações de Sistema básicas
zh_hans: 步骤8：系统基础配置

source: Please use the web installer at http://localhost/otobo/installer.pl (replace "localhost" with your OTOBO hostname) to set up your database and basic system settings such as email accounts.
pt_br: Por favor, use o instalador da web em http://localhost/otobo/installer.pl (substitua "localhost" pelo seu nome de host OTOBO) para configurar seu banco de dados e configurações básicas do sistema, como contas de email.
zh_hans: 请用 http://localhost/otobo/installer.pl （请用你的主机名替换“localhost”）中的网络安装软件，设置你的数据库和基本系统配置，例如电子邮件账户。

source: Step 9: First Login
pt_br: Passo 9: Primeiro Login
zh_hans: 步骤9：首次登陆

source: Now you are ready to login to your system at http://localhost/otobo/index.pl as user ``root@localhost`` with the password that was generated (see above).
pt_br: Agora você esta pronta para logar no seu sistema em http://localhost/otobo/index.pl com o usuário ``root@localhost`` com a senha que foi gerada (veja acima).
zh_hans: 现在你可以通过http://localhost/otobo/index.pl登陆你的系统了，用户名``root@localhost`` ，密码是上面生成的（请参考之前描述）。

source: Step 10: Start the OTOBO Daemon
pt_br: Passo 10: Inicie o Daemon do OTOBO
zh_hans: 步骤10：启动OTOBO Daemon

source: OTOBO daemon is responsible for handling any asynchronous and recurring tasks in OTOBO. What has been in cron file definitions previously is now handled by the OTOBO daemon, which is required to operate OTOBO. The daemon also handles all GenericAgent jobs and must be started from the OTOBO user.
pt_br: O daemon OTOBO é responsável por manipular qualquer tarefa assíncrona e recorrente no OTOBO. O que havia sido definido anteriormente nos arquivos cron agora é tratado pelo daemon OTOBO, necessário para operar o OTOBO. O daemon também manipula todas as tarefas GenericAgent e deve ser iniciado a partir do usuário OTOBO.
zh_hans: OTOBO守护程序的任务是处理OTOBO系统中的不同步的和重复性的工作。之前在cron文件定义中描述的现在由OTOBO守护程序处理，这是运行OTOBO的需要。守护程序还要处理由用户发起的GenericAgent任务。

source: Step 11: Cron jobs for the OTOBO user
pt_br: Passo 11: Tarefas Cron para o usuário OTOBO
zh_hans: 步骤11：OTOBO用户的cron任务

source: There are two default OTOBO cron files in ``/opt/otobo/var/cron/\*.dist``, and their purpose is to make sure that the OTOBO Daemon is running. They need to be be activated by copying them without the ".dist" filename extension.
pt_br: Existem dois arquivos cron OTOBO padrão em /opt/otobo/var/cron/\*.dist, e seu objetivo é garantir que o Daemon OTOBO esteja em execução. Eles precisam ser ativados, copiando-os sem a extensão de arquivo ".dist".
zh_hans: 在``/opt/otobo/var/cron/\*.dist``中有两个默认的cron文件，目的是确保OTOBO Daemon守护程序已经运行起来了。激活这两个文件只需要不带“.dist"扩展名进行拷贝就好。

source: With this step, the basic system setup is finished.
pt_br: Com esta etapa, a configuração básica do sistema está concluída.
zh_hans: 到这一步，基本的系统配置就完成了。

source: Step 12: Setup Bash Auto-Completion (optional)
pt_br: Passo 12: Configurar o auto completar do bash (opcional)
zh_hans: 步骤12：设置Bash Auto-Completion （可选）

source: All regular OTOBO command line operations happen via the OTOBO console interface. This provides an auto-completion for the bash shell which makes finding the right command and options much easier.
pt_br: Todas as operações regulares da linha de comando OTOBO acontecem através da interface do console OTOBO. Isso fornece um preenchimento automático para o shell bash, o que facilita a localização do comando e das opções corretas.
zh_hans: 所有正常的OTOBO命令行的执行都是通过OTOBO管理接口，管理接口可以实现Linux内核任务的自动完成，从而更方便地找到合适的命令和选项。

source: You can activate the bash auto-completion by installing the package ``bash-completion``. It will automatically detect and load the file ``/opt/otobo/.bash_completion`` for the ``otobo`` user.
pt_br: Você pode ativar o auto-completion do bash instalando o pacote ``bash-completion``. Ele detectará e carregará o arquivo automaticamente ``/opt/otobo/.bash_completion`` para o usuário ``otobo``.
zh_hans: 你可以通过安装软件包``bash-completion``来激活内核任务自动完成，它将为``otobo`` 用户自动检测并调用``/opt/otobo/.bash_completion``文件。

source: After restarting your shell, you can just type this command followed by TAB, and it will list all available commands:
pt_br: Após reiniciar seu shell, você pode apenas digitar este comando, seguido de TAB, e ele listará todos os comandos disponíveis:
zh_hans: 重启你的shell后，你可以键入这个命令再加上TAB，就会列出所有可用的命令：

source: If you type a few characters of the command name, TAB will show all matching commands. After typing a complete command, all possible options and arguments will be shown by pressing TAB.
pt_br: Se você digitar alguns caracteres do nome do comando, o TAB exibirá todos os comandos correspondentes. Após digitar um comando completo, todas as opções e argumentos possíveis serão mostrados pressionando TAB.
zh_hans: 如果你只键入命令名字的几个字母，TAB将会列出所有匹配的命令。键入完整命令，按下TAB键将显示所有的可选项和相应信息。

source: If you have problems, you can execute the following line as user ``otobo`` and add it to your ``~/.bashrc`` to execute the commands from the file.
pt_br: Se tiver problemas, você pode executar a seguinte linha como usuário ``otobo`` e adicioná-la ao seu ``~/ .bashrc`` para executar os comandos do arquivo.
zh_hans: 如果有问题，你可以作为用户``otobo`` 执行下面的命令行，并将它加入你的``~/.bashrc`` ，执行文件中的命令。

source: Step 13: Further Information
pt_br: Passo 13: Informações adicionais
zh_hans: 步骤13：更多信息

source: We advise you to read the OTOBO :doc:`performance-tuning` chapter.
pt_br: Recomendamos que você leia o capítulo OTOBO :doc:`performance-tuning`.
zh_hans: 我们建议你阅读OTOBO文档中的：`performance-tuning` 章节。

source: Installing using Docker and Docker Compose
pt_br: Instalando usando Docker e Docker Compose
zh_hans: 安装应用 Docker和Docker Compose

source: With the dockerized OTOBO deployment you can get your personal OTOBO instance up and running within minutes. All of OTOBO´s dependencies are already included in the collection of Docker images.
pt_br: Com a implantação do OTOBO em docker, você pode colocar sua instância pessoal do OTOBO em funcionamento em minutos. Todas as dependências do OTOBO já estão incluídas na coleção de imagens do Docker.
zh_hans: 用容器虚拟化实施你的OTOBO系统，你可以马上建立你的个人OTOBO并在几分钟内开始运行，因为所有的OTOBO需要的外部环境软件都已经包括在内了。

source: MariaDB is set up as the default database.
pt_br: MariaDB é configurado como o banco de dados padrão.
zh_hans: MariaDB被设置为默认数据库。

source: Elasticsearch is set up for the OTOBO power search.
pt_br: Elasticsearch é configurado para a busca avançada no OTOBO.
zh_hans: 为OTOBO建立Elasticsearch进行强力搜索。

source: Redis is enabled for fast caching.
pt_br: Redis está habilitado para cache rápido.
zh_hans: 启用Redis进行快速缓存。

source: Gazelle is used as fast Perl webserver.
pt_br: Gazelle é usado como um servidor web Perl rápido.
zh_hans: Gazelle用来作为快速Perl网站服务器。

source: nginx is used as optional reverse proxy for HTTPS support.
pt_br: nginx é usado como proxy reverso opcional para suporte HTTPS.
zh_hans: nginx作为HTTPS支持的可选网络代理。

source: We think that this will become the perfect environment for an OTOBO installation.
pt_br: Acreditamos que este se tornará o ambiente perfeito para uma instalação OTOBO.
zh_hans: 我们认为这将成为OTOBO安装的最优环境。

source: Requirements
pt_br: Requerimentos
zh_hans: 需求

source: The minimal versions of required software, that have been tested, are listed here:
pt_br: As versões mínimas do software necessário, que foram testadas, estão listadas aqui:
zh_hans: 经过测试的所需软件最低版本，请参考下面列表：

source: To get the required minimal versions on Ubuntu 18.04 follow the instructions in https://www.digitalocean.com/community/tutorials/how-to-install-docker-compose-on-ubuntu-18-04 and https://www.digitalocean.com/community/tutorials/how-to-install-and-use-docker-on-ubuntu-18-04.
pt_br: Para obter as versões mínimas necessárias no Ubuntu 18.04, siga as instruções em https://www.digitalocean.com/community/tutorials/how-to-install-docker-compose-on-ubuntu-18-04 e https://www.digitalocean.com/community/tutorials/how-to-install-and-use-docker-on-ubuntu-18-04.
zh_hans: 要得到所需的Ubuntu18.04最低版本，请按照https://www.digitalocean.com/community/tutorials/how-to-install-docker-compose-on-ubuntu-18-04和https://wwwdigitalocean.com/community/tutorials/how-to-install-and-use-docker-on-ubuntu-18-04中的说明进行操作。

source: git, Docker, and Docker Compose can be installed with the standard system tools. Here is an example for installation on Ubuntu 20.04:
pt_br: git, Docker e Docker Compose podem ser instalados com as ferramentas de sistema padrão. Aqui está um exemplo de instalação no Ubuntu 20.04:
zh_hans: 可以使用标准系统工具来安装git，Docker和Docker Compose。这是在Ubuntu 20.04上安装的示例：

source: Please check the Git and the Docker documentation for instructions on further setup.
pt_br: Verifique a documentação do Git e do Docker para obter instruções sobre configurações adicionais.
zh_hans: 请查看Git和Docker文档，得到更多步骤的说明。

source: Installation
pt_br: Instalação
zh_hans: 安装

source: The following instructions assume that all requirements are met, that you have a working Docker environment. We assume here that the user **docker_admin** is used for interacting with Docker. The Docker admin may be either the **root** user of the Docker host or a dedicated user with the required permissions.
pt_br: As instruções a seguir pressupõem que todos os requisitos sejam atendidos, que você tenha um ambiente Docker funcionando. Presumimos aqui que o usuário **docker_admin** é usado para interagir com o Docker. O administrador do Docker pode ser o usuário **root** do host do Docker ou um usuário dedicado com as permissões necessárias.
zh_hans: 下面的介绍是在假设所有需要的系统都已经安装，并且你已经有了一个工作的Docker环境。我们假设用户**root**被用来和Docker互动，请注意针对一个生产环境，需要有一个专用用户作为Docker管理员。

source: 1. Clone the otobo-docker repo
pt_br: 1. Clone o repositório otobo-docker
zh_hans: 1. 克隆otobo-docker存储

source: The location of the cloned repository does not matter. For these instructions we chose */opt/otobo-docker* as the working dir.
pt_br: A localização do repositório clonado não importa. Para essas instruções, escolhemos */opt/otobo-docker* como o diretório de trabalho.
zh_hans: 克隆副本的位置并不重要，在介绍中我们选择 */opt/otobo-docker*作为工作目录。

source: 2. Create an initial *.env* file
pt_br: 2. Crie um arquivo *.env* inicial
zh_hans: 2. 创建初始*.env*文件

source: The Docker Compose configuration file *.env* allows you to manage your installation of OTOBO. This file must first be created and then be adapted by yourself. In order to simplify the task there are two example files that should be used as starting point. If the OTOBO web application is planned to be accessed via HTTPS, then please use *.docker_compose_env_https*. Access via HTTPS is the recommended mode of operation. If HTTPS is not required then use *.docker_compose_env_http* as the starting point.
pt_br: O arquivo de configuração *.env* do Docker Compose permite que você gerencie sua instalação do OTOBO. Este arquivo deve primeiro ser criado e então adaptado por você. Para simplificar a tarefa, existem dois arquivos de exemplo que devem ser usados como ponto de partida. Se o aplicativo da web OTOBO for planejado para ser acessado via HTTPS, use *.docker_compose_env_https*. O acesso via HTTPS é o modo de operação recomendado. Se HTTPS não for necessário, use *.docker_compose_env_http* como ponto de partida.
zh_hans: Docker Compose配置文件* .env *让你可以管理OTOBO的安装。你必须先创建此文件，然后根据情况修改。为了简化工作，这里有两个示例文件可以作为起始点。如果要通过HTTPS访问OTOBO Web应用程序，请使用* .docker_compose_env_https *，我们建议使用HTTPS进行访问操作。如果不需要HTTPS，可以使用* .docker_compose_env_http *作为起点。

source: Use ``ls -a`` for listing the hidden template files.
pt_br: Use ``ls -a`` para listar os arquivos de template ocultos.
zh_hans: 用``ls -a`` 列出隐藏的模板文件。

source: Per default OTOBO is served on the standard ports. Port 443 for HTTPS and port 80 for HTTP. When HTTPS is activated then the OTOBO web application actually still runs with HTTP. HTTPS support is achieved by an additional reverse proxy, which is implemented as a nginx service.
pt_br: Por padrão, o OTOBO é servido nas portas padrão. Porta 443 para HTTPS e porta 80 para HTTP. Quando o HTTPS é ativado, o aplicativo da web OTOBO ainda é executado com HTTP. O suporte HTTPS é obtido por um proxy reverso adicional, que é implementado como um serviço nginx.
zh_hans: 默认情况下，OTOBO在标准端口上提供， HTTPS的端口443和端口80。激活HTTPS后，OTOBO Web应用程序实际上始终使用HTTP运行。 HTTPS的支持通过另外的反向代理来实现，该代理通过nginx服务实现。

source: For the following commands we assume that HTTPS should be supported.
pt_br: Para os comandos a seguir, presumimos que HTTPS deve ser compatível.
zh_hans: 我们假定以下命令都支持HTTPS。

source: 3. Configure the password for the database admin user
pt_br: 3. Configure a senha para o usuário administrador do banco de dados
zh_hans: 3. 为数据库管理员用户设置密码

source: Change the following setting inside your *.env* file:
pt_br: Altere o seguinte valor dentro do arquivo *.env*:
zh_hans: 调整*.env*文件中的以下数值：

source: The password for the database admin user may be chosen freely. The database admin user is needed to create the database user **otobo** and the database schema **otobo**. OTOBO will actually use the dedicated database user **otobo**.
pt_br: A senha do usuário administrador do banco de dados pode ser escolhida livremente. O usuário administrador do banco de dados é necessário para criar o usuário do banco de dados **otobo** e o esquema do banco de dados **otobo**. O OTOBO realmente usará o usuário de banco de dados dedicado **otobo**.
zh_hans: ``OTOBO_DB_ROOT_PASSWORD``数据库管理员的密码可以自由选择，数据库管理员创建了数据库用户**otobo**和数据库模式**otobo**。

source: 4. Set up a volume with SSL configuration for the nginx webproxy (optional)
pt_br: 4. Configure um volume com configuração SSL para o nginx webproxy (opcional)
zh_hans: 4. 为nginx网络代理建立一个带有SSL设置的卷（可选）

source: This step can be skipped when OTOBO should be available only via HTTP.
pt_br: Esta etapa pode ser ignorada quando o OTOBO deve estar disponível apenas via HTTP.
zh_hans: 如果OTOBO只能通过HTTP进行，这个步骤就可以跳过。

source: nginx needs for SSL encryption a certificate and a private key.
pt_br: O nginx precisa de um certificado e uma chave privada para criptografia SSL.
zh_hans: nginx需要SSL加密的证书和私钥。

source: For testing and development a self-signed certificate can be used. However for productive use you should work with regular registered certificates.
pt_br: Para teste e desenvolvimento, um certificado auto-assinado pode ser usado. No entanto, para uso produtivo, você deve trabalhar com certificados regulares registrados.
zh_hans: 为了进行测试和开发，可以使用自签名证书。在一般情况下，必须使用注册证书。

source: See e.g. https://www.digitalocean.com/community/tutorials/how-to-create-a-self-signed-ssl-certificate-for-nginx-in-ubuntu-18-04 on how to create self-signed certificates.
pt_br: Veja, por exemplo https://www.digitalocean.com/community/tutorials/how-to-create-a-self-signed-ssl-certificate-for-nginx-in-ubuntu-18-04 sobre como criar certificados auto-assinados.
zh_hans: 参考<https://www.digitalocean.com/community/tutorials/how-to-create-a-self-signed-ssl-certificate-for-nginx-in-ubuntu-18-04>`中的案例，如何创建自己签名的证书。

source: To specify a CA chain with a certificate in nginx, it is necessary to copy the CA chain file with the actual certificate into a file.
pt_br: Para especificar uma cadeia de CA com um certificado no nginx, é necessário copiar o arquivo de cadeia de CA com o certificado real em um arquivo.
zh_hans: 在nginx中指定一个带有证书的CA链，需要将这个带有实际证书的CA链文件考入一个文件中去。
