Repository: Monviech/otobo-doc-otobo-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: pt_br, zh_hans

source: The certificate and the private key are stored in a volume, so that they can be used by nginx later on. In any case the volume needs to be generated manually, and we need to copy the certificate and key to the volume:
pt_br: O certificado e a chave privada são armazenados em um volume, para que possam ser usados pelo nginx posteriormente. Em qualquer caso, o volume precisa ser gerado manualmente e precisamos copiar o certificado e a chave para o volume:
zh_hans: 证书和私钥存储在一个卷中，以便以后Nginx使用，在任何情况下，都需要手动生成该卷，并且需要将证书和密钥复制到该卷：

source: The names of the copied files need to be set in our newly created *.env* file. E.g.
pt_br: Os nomes dos arquivos copiados precisam ser definidos em nosso arquivo *.env* recém-criado. Por exemplo.
zh_hans: 需要在我们新创建的* .env *文件中设置复制文件的名称，例如。

source: Please adapt only the name of the files as the path */etc/nginx/ssl/* is hard coded in the Docker image.
pt_br: Adapte apenas o nome dos arquivos, pois o caminho */etc/nginx/ssl/* é codificado na imagem do Docker.
zh_hans: 请仅调整文件名，因为路径* / etc / nginx / ssl / *在Docker映像中是硬编码的。

source: 5. Start the Docker containers with Docker Compose
pt_br: 5. Inicie os contêineres do Docker com Docker Compose
zh_hans: 安装应用 Docker和Docker Compose

source: Now we start the Docker containers using ``docker-compose``. Per default the Docker images will be fetched from https://hub.docker.com/u/rotheross.
pt_br: Agora iniciamos os contêineres do Docker usando ``docker-compose``. Por padrão, as imagens do Docker serão obtidas em https://hub.docker.com/u/rotheross.
zh_hans: 现在我们使用``docker-compose``启动Docker容器。默认情况下，将从https://hub.docker.com/u/rotheross获取Docker映像。

source: To verify that the six required services (five in the case of HTTP only) are actually running, type:
pt_br: Para verificar se os seis serviços necessários (cinco no caso de HTTP apenas) estão realmente em execução, digite:
zh_hans: 在使用HTTP的情况下，要验证六个或五个服务是否正在实际运行，请输入：

source: 6. Install and start OTOBO
pt_br: 6. Instale e inicie o OTOBO
zh_hans: 6. 安装和启动OTOBO

source: Run the OTOBO installer at http://yourIPorFQDN/otobo/installer.pl.
pt_br: Execute o instalador OTOBO em http: //yourIPorFQDN/otobo/installer.pl.
zh_hans: 在http：//yourIPorFQDN/otobo/installer.pl中运行OTOBO安装程序。

source: Please configure OTOBO inside the installer with a new MySQL database. As MySQL database root password please use the password you configured in the variable ``OTOBO_DB_ROOT_PASSWORD`` of your *.env* file. Please leave the value ``db`` for the MySQL hostname untouched.
pt_br: Configure o OTOBO dentro do instalador com um novo banco de dados MySQL. Como senha root do banco de dados MySQL, use a senha que você configurou na variável ``OTOBO_DB_ROOT_PASSWORD`` do seu arquivo *.env*. Por favor, deixe o valor ``db`` para o nome do host MySQL intocado.
zh_hans: 请使用新的MySQL数据库在安装程序中配置OTOBO。作为MySQL数据库的根密码，请使用您在* .env *文件的变量``OTOBO_DB_ROOT_PASSWORD''中配置的密码。请保持MySQL主机名的``db''值不变。

source: **Have fun with OTOBO!**
pt_br: **Divirta-se com o OTOBO!**
zh_hans: **与OTOBO玩得开心吧！**

source: To change to the OTOBO directory, inside the running container, to work on command line as usual, you can use the following Docker command: ``docker exec -it otobo_web_1 bash``.
pt_br: Para mudar para o diretório OTOBO, dentro do contêiner em execução, trabalhar na linha de comando como de costume, você pode usar o seguinte comando do Docker: ``docker exec -it otobo_web_1 bash``.
zh_hans: 要切换到运行容器内的OTOBO目录，以便正常在命令行下工作，可以使用以下Docker命令：``docker exec -it otobo_web_1 bash``。

source: Additional technical information
pt_br: Informações técnicas adicionais
zh_hans: 附加技术信息

source: This section gives some more technical insight into what is happing under the hood.
pt_br: Esta seção oferece mais informações técnicas sobre o que está acontecendo nos bastidores.
zh_hans: 本节对隐含的内容提供了更多的技术见解。

source: List of Docker containers
pt_br: Lista de contêineres Docker
zh_hans: Docker容器列表

source: Container otobo_web_1
pt_br: Contêiner otobo_web_1
zh_hans: 容器otobo_web_1

source: OTOBO webserver on internal port 5000.
pt_br: Servidor web OTOBO na porta interna 5000.
zh_hans: 内部端口5000上的OTOBO Web服务器。

source: Container otobo_daemon_1
pt_br: Contêiner otobo_daemon_1
zh_hans: 容器otobo_daemon_1

source: OTOBO daemon. The OTOBO daemon is started and periodically checked.
pt_br: Daemon OTOBO. O daemon OTOBO é iniciado e verificado periodicamente.
zh_hans: OTOBO守护程序。 OTOBO守护程序已启动并定期检查。

source: Container otobo_db_1
pt_br: Contêiner otobo_db_1
zh_hans: 容器otobo_db_1

source: Run the database MariaDB on internal port 3306.
pt_br: Executa o banco de dados MariaDB na porta interna 3306.
zh_hans: 在内部端口3306上运行数据库MariaDB。

source: Container otobo_elastic_1
pt_br: Contêiner otobo_elastic_1
zh_hans: 容器otobo_elastic_1

source: Elasticsearch on the internal ports 9200 and 9300.
pt_br: Elasticsearch nas portas internas 9200 e 9300.
zh_hans: 在内部端口9200和9300上运行Elasticsearch。

source: Container otobo_redis_1
pt_br: Contêiner otobo_redis_1
zh_hans: 容器otobo_redis_1

source: Run Redis as caching service.
pt_br: Execute o Redis como serviço de cache.
zh_hans: 将Redis作为缓存服务运行。

source: Optional container otobo_nginx_1
pt_br: Contêiner opcional otobo_nginx_1
zh_hans: 可选容器otobo_nginx_1

source: Run nginx as reverse proxy for providing HTTPS support.
pt_br: Execute o nginx como proxy reverso para fornecer suporte HTTPS.
zh_hans: 运行nginx作为反向代理以提供HTTPS支持。

source: Overview over the Docker volumes
pt_br: Visão geral dos volumes do Docker
zh_hans: Docker卷概述

source: The Docker volumes are created on the host for persistent data. These allow starting and stopping the services without losing data. Keep in mind that containers are temporary and only data in the volumes is permanent.
pt_br: Os volumes Docker são criados no host para dados persistentes. Isso permite iniciar e interromper os serviços sem perder dados. Lembre-se de que os contêineres são temporários e apenas os dados nos volumes são permanentes.
zh_hans: Docker卷是在主机上创建的，用于持久性数据。这些允许启动和停止服务而不会丢失数据。请记住，容器是临时的，只有卷中的数据是永久的。

source: contains `/opt/otobo` in the container `web` and `daemon`.
pt_br: contém `/opt/otobo` no container `web` e `daemon`.
zh_hans: 容器 `web` 和 `daemon`中包含`/opt/otobo` 。

source: contains `/var/lib/mysql` in the container `db`.
pt_br: contém `/var/lib/mysql` no container `db`.
zh_hans: 容器`db`包含`/var/lib/mysql`。

source: contains `/usr/share/elasticsearch/datal` in the container `elastic`.
pt_br: contém `/usr/share/elasticsearch/datal` no container `elastic`.
zh_hans: 容器`elastic`包含`/usr/share/elasticsearch/datal`。

source: contains data for the container `redis`.
pt_br: contém dados para o contêiner `redis`.
zh_hans: 包含容器“ redis”的数据。

source: contains the TLS files, certificate and private key, must be initialized manually.
pt_br: contém os arquivos TLS, certificado e chave privada, deve ser inicializado manualmente.
zh_hans: 包含TLS文件，证书和私钥，必须手动初始化。

source: Docker environment variables
pt_br: Variáveis de ambiente do Docker
zh_hans: Docker环境变量

source: In the instructions we did only minimal configuration. But the file *.env* allows to set more variables. Here is a list of all supported environment variables:
pt_br: Nas instruções, fizemos apenas uma configuração mínima. Mas o arquivo *.env* permite definir mais variáveis. Aqui está uma lista de todas as variáveis de ambiente com suporte:
zh_hans: 在说明中，我们仅进行了最少的配置。但是文件* .env *允许设置更多变量。这是所有支持的环境变量的列表：

source: **MariaDB settings**
pt_br: **Configurações MariaDB**
zh_hans: **MariaDB设置**

source: The root password for MySQL. Must be set for running otobo db.
pt_br: A senha raiz do MySQL. Deve ser definido para rodar otobo db.
zh_hans: MySQL的根密码。必须设置为运行otobo db。

source: **Elasticsearch settings**
pt_br: **Configurações do Elasticsearch**
zh_hans: **Elasticsearch设置**

source: Elasticsearch needs some settings for productive environments. Please read https://www.elastic.co/guide/en/elasticsearch/reference/7.8/docker.html#docker-prod-prerequisites for detailed information.
pt_br: Elasticsearch precisa de algumas configurações para ambientes de produção. Por favor leia https://www.elastic.co/guide/en/elasticsearch/reference/7.8/docker.html#docker-prod-prerequisites para informações detalhadas.
zh_hans: Elasticsearch需要在生产环境中进行一些设置。请阅读https://www.elastic.co/guide/zh-CN/elasticsearch/reference/7.8/docker.html#docker-prod-prerequisites了解详细信息。

source: Example setting: *OTOBO_Elasticsearch_ES_JAVA_OPTS=-Xms512m -Xmx512m* Please adjust this value for production env to a value up to 4g.
pt_br: Configuração de exemplo: *OTOBO_Elasticsearch_ES_JAVA_OPTS=-Xms512m -Xmx512m* Ajuste este valor para env de produção para um valor de até 4g.
zh_hans: 设置案例：* OTOBO_Elasticsearch_ES_JAVA_OPTS = -Xms512m -Xmx512m *，在生产环境中，请将该值提高为4G。

source: **Webserver settings**
pt_br: **Configurações do Webserver **
zh_hans: **Webserver设置**

source: Set in case the HTTP port should deviate from the standard port 80. When HTTPS is enabled, the HTTP port will redirect to HTTPS.
pt_br: Definido caso a porta HTTP deva se desviar da porta 80 padrão. Quando HTTPS está habilitado, a porta HTTP redireciona para HTTPS.
zh_hans: 设置以防HTTP端口偏离标准端口80。启用HTTPS时，HTTP端口将重定向到HTTPS。

source: **nginx webproxy settings**
pt_br: **configurações do webproxy nginx**
zh_hans: **nginx网络代理设置**

source: These setting are used when HTTPS is enabled.
pt_br: Essas configurações serão usadas quando HTTPS está habilitado.
zh_hans: 这些设置在启用HTTPS时使用。

source: Set in case the HTTP port should deviate from the standard port 80. Will redirect to HTTPS.
pt_br: Definido caso a porta HTTP se desvie da porta 80 padrão. Irá redirecionar para HTTPS.
zh_hans: 设置以防HTTP端口偏离标准端口80。将重定向到HTTPS。

source: Set in case the HTTPS port should deviate from the standard port 443.
pt_br: Definido no caso de a porta HTTPS se desviar da porta 443 padrão.
zh_hans: 设置以防HTTPS端口偏离标准端口443。

source: SSL cert for the nginx webproxy. Example: *OTOBO_NGINX_SSL_CERTIFICATE=/etc/nginx/ssl/acme.crt*
pt_br: Certificado SSL para o webproxy nginx. Exemplo: *OTOBO_NGINX_SSL_CERTIFICATE=/etc/nginx/ssl/acme.crt*
zh_hans: Nginx Webproxy的SSL证书。例如：* OTOBO_NGINX_SSL_CERTIFICATE = / etc / nginx / ssl / acme.crt *

source: SSL key for the nginx webproxy. Example: *OTOBO_NGINX_SSL_CERTIFICATE_KEY=/etc/nginx/ssl/acme.key*
pt_br: Chave SSL para o webproxy nginx. Exemplo: *OTOBO_NGINX_SSL_CERTIFICATE_KEY=/etc/nginx/ssl/acme.key*
zh_hans: Nginx Webproxy的SSL密钥。例如：* OTOBO_NGINX_SSL_CERTIFICATE_KEY = / etc / nginx / ssl / acme.key *

source: **Docker Compose settings**
pt_br: **Configurações do Docker Compose**
zh_hans: **docker-compose设置**

source: These settings are used by Docker Compose directly.
pt_br: Essas configurações são usadas diretamente pelo Docker Compose.
zh_hans: 这些设置由docker-compose直接使用。

source: The project name is used as a prefix for the generated volumes and containers. Must be set because the compose file is located in *scripts/docker-compose* and thus **docker-compose** would be used per default as the project name.
pt_br: O nome do projeto é usado como um prefixo para os volumes e contêineres gerados. Deve ser definido porque o arquivo de composição está localizado em *scripts/docker-compose* e, portanto, **docker-compose** seria usado por padrão como o nome do projeto.
zh_hans: 项目名称是用作生成的卷和容器的前缀。必须设置，因为编辑的文件位于* scripts / docker-compose *中，默认情况下将使用 **docker-compose**作为项目名称。

source: Separator for the value of COMPOSE_FILE
pt_br: Separador para o valor de COMPOSE_FILE
zh_hans: COMPOSE_FILE数值的分隔符

source: Use *docker-compose/otobo-base.yml* as the base and add the wanted extension files. E.g *docker-compose/otobo-override-http.yml* or *docker-compose/otobo-override-https.yml*.
pt_br: Use *docker-compose/otobo-base.yml* como base e adicione os arquivos de extensão desejados. Por exemplo *docker-compose/otobo-override-http.yml* ou *docker-compose/otobo-override-https.yml*.
zh_hans: 使用* docker-compose / otobo-base.yml *作为基础，并添加所需的扩展文件。例如* docker-compose / otobo-override-http.yml *或* docker-compose / otobo-override-https.yml *。

source: Used for specifying alternative Docker images. Useful for testing local builds.
pt_br: Usado para especificar imagens alternativas do Docker. Útil para testar compilações locais.
zh_hans: 用于指定备用Docker映像，这对测试本地版本很有用。

source: Advanced topics
pt_br: Tópicos avançados
zh_hans: 进阶主题

source: Custom configuration of the nginx webproxy
pt_br: Configuração personalizada do nginx webproxy
zh_hans: Nginx网络代理的自定义配置

source: The default Docker-based OTOBO installation provides the container `otobo_nginx_1`. This container provides HTTPS support for the HTTP-based OTOBO web application. The default config template for nginx can be found within the Docker image, specifically in the file */etc/nginx/template/otobo_nginx.conf.template*. When the container is started, the actually used configuration file is generated from the template. This is done by replacing each macro in the template with the corresponding environment variable. In the default template file, only the following macros are used: * `${OTOBO_NGINX_SSL_CERTIFICATE}` * `${OTOBO_NGINX_SSL_CERTIFICATE_KEY} * `${OTOBO_NGINX_WEB_HOST}` * `${OTOBO_NGINX_WEB_PORT}`
pt_br: A instalação padrão do OTOBO baseada em Docker fornece o contêiner `otobo_nginx_1`. Este contêiner fornece suporte HTTPS para o aplicativo da web OTOBO baseado em HTTP. O modelo de configuração padrão para nginx pode ser encontrado na imagem Docker, especificamente no arquivo */etc/nginx/template/otobo_nginx.conf.template*. Quando o contêiner é iniciado, o arquivo de configuração realmente usado é gerado a partir do modelo. Isso é feito substituindo cada macro no modelo pela variável de ambiente correspondente. No arquivo de modelo padrão, apenas as seguintes macros são usadas: * `${OTOBO_NGINX_SSL_CERTIFICATE}` * `${OTOBO_NGINX_SSL_CERTIFICATE_KEY} * `${OTOBO_NGINX_WEB_HOST}` * `${OTOBO_NGINX_WEB_PORT}`
zh_hans: 基于Docker的默认OTOBO安装提供了容器otobo_nginx_1，为基于HTTP的OTOBO Web应用程序提供HTTPS支持。 nginx的默认配置模板可以在Docker映像中找到，特别是在文件* / etc / nginx / template / otobo_nginx.conf.template *中。启动容器后，将从模板生成实际使用的配置文件。这是通过用相应的环境变量替换模板中的每个宏来完成的。在默认模板文件中，仅使用以下宏：*`$ {OTOBO_NGINX_SSL_CERTIFICATE}`*`$ {OTOBO_NGINX_SSL_CERTIFICATE_KEY} *`$ {OTOBO_NGINX_WEB_HOST}`*`$ {OTOBO_NGINX_WEB_PORT}`

source: There are various possibilities for customizing the nginx configuration. One way is to use a locally built image that is derived from the image `otobo-nginx-webproxy`. In such a local image, nginx can be configured in a very flexible way.
pt_br: Existem várias possibilidades para personalizar a configuração do nginx. Uma maneira é usar uma imagem construída localmente que é derivada da imagem `otobo-nginx-webproxy`. Nessa imagem local, o nginx pode ser configurado de uma forma muito flexível.
zh_hans: 自定义nginx配置有多种可能性。一种方法是使用从otobo-nginx-webproxy派生的本地镜像。在这样的本地镜像中，可以非常灵活地配置nginx。

source: The following approach is only supported in OTOBO 10.0.4 or later.
pt_br: A abordagem a seguir só é compatível com OTOBO 10.0.4 ou posterior.
zh_hans: 只有OTOBO 10.0.4或更高版本支持以下方法。

source: Another supported approach is to only override the default config template with a customized version. In this case, we have to create a volume that contains the adapted nginx config template, first.
pt_br: Outra abordagem com suportada é apenas de substituir o modelo de configuração padrão por uma versão personalizada. Nesse caso, primeiro temos que criar um volume que contenha o template de configuração nginx adaptado.
zh_hans: 另一种可行的方法是使用自定义版本覆盖默认配置模板。在这种情况下，我们必须首先创建一个卷，包含nginx修改后的配置模板。

source: Your adapted nginx configuration usually contains the directive **listen**, which declares the ports of the webserver. The internally used ports have changed between OTOBO 10.0.3 and OTOBO 10.0.4. This change must be reflected in the adapted nginx configuration. So for version 10.0.3 or earlier listen to the ports 80 and 443. For OTOBO 10.0.4 listen to the ports 8080 and 8443.
pt_br: Sua configuração nginx adaptada geralmente contém a diretiva **listen**, que declara as portas do servidor web. As portas usadas internamente foram alteradas entre OTOBO 10.0.3 e OTOBO 10.0.4. Essa mudança deve ser refletida na configuração nginx adaptada. Portanto, para a versão 10.0.3 ou anterior, escute as portas 80 e 443. Para o OTOBO 10.0.4, escute as portas 8080 e 8443.
zh_hans: 调整后的Nginx配置通常包含指令** listen **，以明确Web服务器的端口。在OTOBO 10.0.3和OTOBO 10.0.4两个版本中，内部使用的端口有所变化。这个变化必须体现在调整后的nginx配置中。因此，对于10.0.3或更早版本，请使用端口80和443。对于OTOBO 10.0.4，请使用端口8080和8443。

source: After setting up the volume, the adapted configuration must be activated. In order to achieve this, uncomment or add the following lines in your *.env* file:
pt_br: Após configurar o volume, a configuração adaptada deve ser ativada. Para fazer isso, descomente ou adicione as seguintes linhas em seu arquivo *.env* :
zh_hans: 创立卷之后，必须激活调整后的配置。为此，请取消注释或在* .env *文件中添加以下行：

source: The changed Docker Compose configuration can be inspected with:
pt_br: A configuração do Docker Compose alterada pode ser inspecionada com:
zh_hans: 更改后的Docker Compose配置可以通过以下方式进行检查：

source: Finally, the containers can be started again:
pt_br: Finalmente, os contêineres podem ser iniciados novamente:
zh_hans: 最后，可以再次启动容器：

source: See also the section "Using environment variables in nginx configuration (new in 1.19)" in https://hub.docker.com/_/nginx.
pt_br: Consulte também a seção "Using environment variables in nginx configuration (new in 1.19)" em https://hub.docker.com/_/nginx.
zh_hans: 另请参见https://hub.docker.com/_/nginx中的“在nginx配置中使用环境变量（1.19中的新功能）”部分。

source: Choosing non-standard ports
pt_br: Escolhendo portas não padrão
zh_hans: 选择非标准端口

source: Per default the ports 443 and 80 serve HTTPS and HTTP respectively. There can be cases where one or both of these ports are already used by other services. In these cases the default ports can be overridden by specifying `OTOBO_WEB_HTTP_PORT` and `OTOBO_WEB_HTTPS_PORT` in the *.env* file.
pt_br: Por padrão, as portas 443 e 80 atendem HTTPS e HTTP, respectivamente. Pode haver casos em que uma ou ambas as portas já são usadas por outros serviços. Nestes casos, as portas padrão podem ser substituídas especificando `OTOBO_WEB_HTTP_PORT` e `OTOBO_WEB_HTTPS_PORT` no arquivo *.env*.
zh_hans: 默认情况下，端口443和80分别为HTTPS和HTTP服务。在某些情况下，其他服务可能已经使用了这些端口中的一个或两个。在这些情况下，可以通过在* .env *文件中指定`OTOBO_WEB_HTTP_PORT`和`OTOBO_WEB_HTTPS_PORT`来覆盖默认端口。

source: Building local images
pt_br: Construindo imagens locais
zh_hans: 创建本地镜像

source: Building Docker images locally is usually only needed during development.
pt_br: A construção de imagens Docker localmente geralmente só é necessária durante o desenvolvimento.
zh_hans: 通常仅在开发期间才需要在本地构建Docker映像。

source: The files needed for creating Docker images locally are part of the the git repository https://github.com/RotherOSS/otobo:
pt_br: Os arquivos necessários para criar imagens Docker localmente fazem parte do repositório git https://github.com/RotherOSS/otobo:
zh_hans: 在本地创建Docker映像所需的文件是git存储库https://github.com/RotherOSS/otobo的一部分：

source: The locally built images are tagged as ``local-<OTOBO_VERSION>`` using the version set up the file *RELEASE*. After building the local images, one can specify the images to be used by setting ``OTOBO_IMAGE_OTOBO``, ``OTOBO_IMAGE_OTOBO_ELASTICSEARCH``, ``OTOBO_IMAGE_OTOBO_NGINX`` in *.env*.
pt_br: As imagens construídas localmente são marcadas como ``local-<OTOBO_VERSION>`` usando a versão configurada no arquivo *RELEASE*. Após construir as imagens locais, pode-se especificar as imagens a serem usadas configurando ``OTOBO_IMAGE_OTOBO``, ``OTOBO_IMAGE_OTOBO_ELASTICSEARCH``, ``OTOBO_IMAGE_OTOBO_NGINX`` em *.env*.
zh_hans: 使用设置文件* RELEASE *中的版本，将创建的本地镜像标记为“ local- <OTOOB_VERSION>”。建立本地镜像后，可以通过在* .env *中设置`OTOBO_IMAGE_OTOBO'，`OTOBO_IMAGE_OTOBO_ELASTICSEARCH，`OTOBO_IMAGE_OTOBO_NGINX'来指定要使用的镜像。

source: Automatic Installation
pt_br: Instalação automática
zh_hans: 自动安装

source: Instead of going through http://yourIPorFQDN/otobo/installer.pl, one can take a short cut. This is mostly useful for running the test suite on a fresh installation.
pt_br: Em vez de acessar http://yourIPorFQDN/otobo/installer.pl, pode-se tomar um atalho. Isso é útil principalmente para executar o conjunto de testes em uma instalação nova.
zh_hans: 您可以通过捷径来代替http：//yourIPorFQDN/otobo/installer.pl。这对于在全新安装上运行测试套件非常有用。

source: ``docker-compose down -v`` will remove all previous setup and data.
pt_br: ``docker-compose down -v`` irá remover todas as configurações e dados anteriores.
zh_hans: ``docker-compose down -v`` 将清除所有之前的配置和数据。

source: List of useful commands
pt_br: Lista de comandos úteis
zh_hans: 常用命令列表

source: ``docker system prune -a`` system clean-up (removes all unused images, containers, volumes, networks)
pt_br: ``docker system prune -a`` limpeza do sistema (remove todas as imagens, contêineres, volumes e redes não utilizados)
zh_hans: ``docker system prune -a`` 系统清理（清除所有未使用的镜像、容器、卷和网络）

source: ``docker version`` show version
pt_br: Mostrar versão ``docker version``
zh_hans: ``docker version`` 显示版本

source: ``docker build --tag otobo --file=otobo.web.Dockerfile .`` build an image
pt_br: ``docker build --tag otobo --file=otobo.web.Dockerfile .`` constrói uma imagem
zh_hans: ``docker build --tag otobo --file=otobo.web.Dockerfile .`` 创建一个镜像

source: ``docker run --publish 80:5000 otobo`` run the new image
pt_br: ``docker run --publish 80:5000 otobo`` executa a nova imagem
zh_hans: ``docker run --publish 80:5000 otobo``运行新的镜像

source: ``docker run -it -v opt_otobo:/opt/otobo otobo bash`` log into the new image
pt_br: ``docker run -it -v opt_otobo:/opt/otobo otobo bash`` faça login na nova imagem
zh_hans: ``docker run -it -v opt_otobo:/opt/otobo otobo bash`` 登陆新的镜像

source: ``docker run -it -v opt_otobo:/opt/otobo --entrypoint bash otobo`` try that in case entrypoint.sh is broken
pt_br: ``docker run -it -v opt_otobo:/opt/otobo --entrypoint bash otobo`` tente isso caso o entrypoint.sh esteja quebrado
zh_hans: 如果entrypoint.sh被破坏了，可以尝试一下 ``docker run -it -v opt_otobo:/opt/otobo --entrypoint bash otobo``

source: ``docker ps`` show running images
pt_br: ``docker ps`` mostra imagens em execução
zh_hans: ``docker ps`` 显示正在运行的镜像

source: ``docker images`` show available images
pt_br: mostrar imagens disponíveis ``docker images``
zh_hans: ``docker images`` 显示可用的镜像

source: ``docker volume ls`` list volumes
pt_br: lista volumes ``docker volume ls``
zh_hans: ``docker volume ls``列出卷名

source: ``docker volume inspect otobo_opt_otobo`` inspect a volume
pt_br: ``docker volume inspect otobo_opt_otobo`` inspecionar um volume
zh_hans: ``docker volume inspect otobo_opt_otobo`` 检查一个卷

source: ``docker volume inspect --format '{{ .Mountpoint }}' otobo_nginx_ssl`` get volume mountpoint
pt_br: ``docker volume inspect --format '{{ .Mountpoint }}' otobo_nginx_ssl`` obter ponto de montagem de volume
zh_hans: ``docker volume inspect --format '{{ .Mountpoint }}' otobo_nginx_ssl`` 获取卷挂载点

source: ``docker volume rm tmp_volume`` remove a volume
pt_br: ``docker volume rm tmp_volume`` remove um volume
zh_hans: ``docker volume rm tmp_volume``清除一个卷

source: ``docker inspect <container>`` inspect a container
pt_br: ``docker inspect <container>`` inspecionar um contêiner
zh_hans: ``docker inspect <container>`` 检查一个容器

source: ``docker save --output otobo.tar otobo:latest && tar -tvf otobo.tar`` list files in an image
pt_br: ``docker save --output otobo.tar otobo:latest && tar -tvf otobo.tar`` lista os arquivos em uma imagem
zh_hans: ``docker save --output otobo.tar otobo:latest && tar -tvf otobo.tar``显示一个镜像中的文件列表

source: ``docker exec -it nginx-server nginx -s reload`` reload nginx
pt_br: ``docker exec -it nginx-server nginx -s reload`` recarrega o nginx
zh_hans: ``docker exec -it nginx-server nginx -s reload`` 重新加载 nginx
