Repository: Monviech/otobo-doc-otobo-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: pt_br, zh_hans

source: The higher the heap maximum value is set, the more memory can be used by Elasticsearch, which also increases the possible pauses for garbage collection, done by the JVM. Therefore it is recommended to set a value for ``Xmx``, that is not higher than 50% of the physical memory.
pt_br: Quanto maior o valor máximo do heap for definido, mais memória poderá ser usada pelo Elasticsearch, o que também aumentará as possíveis pausas para coleta de lixo, realizadas pela JVM. Portanto, é recomendável definir um valor para ``Xmx``, que não exceda 50% da memória física.
zh_hans: 堆最大值设置得越高，Elasticsearch可以使用更多的内存，这也增加了JVM进行垃圾收集的可能暂停。因此建议为``Xmx''设置一个不大于物理内存50％的值。

source: For more information and good rules of thumb about the heap size, please follow `the official documentation <https://www.elastic.co/guide/en/elasticsearch/reference/current/heap-size.html>`__.
pt_br: Para obter mais informações e boas regras práticas sobre o tamanho da pilha, acesse`the official documentation <https://www.elastic.co/guide/en/elasticsearch/reference/current/heap-size.html>`__.
zh_hans: 有关更多信息和有关堆大小的良好经验法则，请遵循`官方文档 <https://www.elastic.co/guide/en/elasticsearch/reference/current/heap-size.html>`__。

source: Disk Allocation
pt_br: Alocação de disco
zh_hans: 磁盘分配

source: While running the service, Elasticsearch inspects the available disk space. Based on the result, it decides whether to allocate new shards to a cluster node. In some cases it even relocates shards away from a node. This behavior is determined by the current disk capacity. It can be configured by settings in the configuration file *elasticsearch.yml*. Here are some relevant configuration settings. They come with good default values, but might be important in trouble shooting.
pt_br: Ao executar o serviço, o Elasticsearch inspeciona o espaço em disco disponível. Com base no resultado, ele decide se alocar novos shards para um nó do cluster. Em alguns casos, ele até realoca os fragmentos longe de um nó. Esse comportamento é determinado pela capacidade do disco atual. Ele pode ser definido pelas configurações no arquivo de configuração *elasticsearch.yml*. Aqui estão algumas configurações relevantes. Eles vêm com bons valores padrão, mas podem ser importantes na solução de problemas.
zh_hans: 在服务运行期间，Elasticsearch检查可用的磁盘空间，并因此决定是将新的分片分配给相关的群集节点，还是将分片从该特定节点移开。这种行为将由当前磁盘容量控制，并可以在配置文件“ elasticsearch.yml”中进行配置。随附一些重要的配置，这些配置带有较好的默认值，这很重要。

source: Default value of 85%. When this limit is exceeded, Elasticsearch will no longer allocate more shards to the related cluster node. The operation of that node is not influenced and data can still be indexed and searched.
pt_br: Valor padrão de 85%. Quando esse limite for excedido, o Elasticsearch não alocará mais shards para o nó do cluster relacionado. A operação desse nó não é influenciada e os dados ainda podem ser indexados e pesquisados.
zh_hans: 默认值为85％。如果超出此限制，Elasticsearch将不会向相关集群节点分配更多的分片。该节点的操作不会受到影响，并且仍然可以对数据进行索引和搜索。

source: Default value of 90%. When this limit is exceeded, Elasticsearch will try to relocate existing shards to other nodes that have enough space available.
pt_br: Valor padrão de 90%. Quando esse limite for excedido, o Elasticsearch tentará realocar os shards existentes para outros nós que tenham espaço suficiente disponível.
zh_hans: 默认值为90％。如果超出此限制，Elasticsearch将尝试将现有分片重新定位到具有足够可用空间的其他节点（如果可能）。

source: Default value of 95%. When this limit is exceeded, Elasticsearch will update the configuration of all indices, that have at least one shard allocated to the related cluster node, to read-only index blocks. Specifically, they are flagged with ``index.blocks.read_only_allow_delete``.
pt_br: Valor padrão de 95%. Quando esse limite é excedido, o Elasticsearch atualiza a configuração de todos os índices, que têm pelo menos um fragmento alocado para o nó do cluster relacionado, para blocos de índice somente leitura. Especificamente, eles são sinalizados com ``index.blocks.read_only_allow_delete``.
zh_hans: 默认值为95％。如果超出此限制，Elasticsearch将所有索引的配置更新为只读索引块“ index.blocks.read_only_allow_delete”，其中至少一个分片分配给相关的集群节点。从那时起，就不可能将新数据编入此类索引，并且无法进行搜索和删除操作。

source: After that update, it is no longer possible to index new data to such indices. The indexes are restricted to searches and to delete actions only.
pt_br: Após essa atualização, não é mais possível indexar novos dados a esses índices. Os índices são restritos a pesquisas e para excluir ações apenas.

source: If the flood stage was exceeded and certain indices are configured to read-only mode, such configuration *will not* automatically be changed by Elasticsearch. If the related disks contain enough free space again due to manual actions, it is needed to change the configuration back to normal mode manually.
pt_br: Se o flood stage for excedido e determinados índices estiverem configurados no modo somente leitura, essa configuração *não* será alterada automaticamente pelo Elasticsearch. Se os discos relacionados contiverem espaço livre suficiente novamente devido a ações manuais, será necessário alterar a configuração novamente para o modo normal manualmente.
zh_hans: 如果超出了洪水阶段，并且某些索引被配置为只读模式，则这种配置*不会*被Elasticsearch自动更改。如果相关磁盘由于手动操作而再次包含足够的可用空间，则需要将配置手动更改回普通模式。

source: For more information about disk watermarks and disk-based shard allocation, please follow `the official documentation <https://www.elastic.co/guide/en/elasticsearch/reference/current/disk-allocator.html>`__.
pt_br: Para obter mais informações sobre marcas d'água de disco e alocação de shard com base em disco, acesse `the official documentation <https://www.elastic.co/guide/en/elasticsearch/reference/current/disk-allocator.html>`__.
zh_hans: 有关磁盘水印和基于磁盘的分片分配的更多信息，请遵循 `官方文档 <https://www.elastic.co/guide/en/elasticsearch/reference/current/disk-allocator.html>`__。

source: Article Storage
pt_br: Armazenamento de artigos
zh_hans: 物品存放

source: There are two different back end modules for the article storage of phone, email and internal articles. The used article storage can be configured in the setting ``Ticket::Article::Backend::MIMEBase::ArticleStorage``.
pt_br: Existem dois módulos de back-end diferentes para o armazenamento de artigos por telefone, email e artigos internos. O armazenamento de artigos usado pode ser configurado na configuração ``Ticket::Article::Backend::MIMEBase::ArticleStorage``.
zh_hans: 对于电话，电子邮件和内部物品的存储，有两个不同的后端模块。可以在``Ticket :: Article :: Backend :: MIMEBase :: ArticleStorage``中配置使用过的物品存储空间。

source: This default module will store attachments in the database. It also works with multiple front end servers, but requires much storage space in the database.
pt_br: Este módulo padrão armazenará anexos no banco de dados. Também funciona com vários servidores front-end, mas requer muito espaço de armazenamento no banco de dados.
zh_hans: 这个默认模块将附件存储在数据库中，还可以与多个前端服务器一起使用，但是需要很多数据库存储空间。

source: Don't use this with large setups.
pt_br: Não use isso com instalações grandes.
zh_hans: 不要将其用于大型系统。

source: Use this module to store attachments on the local file system. It is fast, but if you have multiple front end servers, you must make sure the file system is shared between the servers. Place it on an NFS share or preferably a SAN or similar solution.
pt_br: Use este módulo para armazenar anexos no sistema de arquivos local. É rápido, mas se você tiver vários servidores front-end, verifique se o sistema de arquivos é compartilhado entre os servidores. Coloque-o em um compartilhamento NFS ou, de preferência, em uma SAN ou solução semelhante.
zh_hans: 使用此模块可将附件存储在本地文件系统上。这样速度很快，但是如果你有多个前端服务器，则必须确保文件系统在服务器之间可以共享。可以将其放在NFS共享文件系统，当然最好放在SAN或类似解决方案上。

source: Recommended for large setups.
pt_br: Recomendado para grandes instalações.
zh_hans: 建议用于大型系统。

source: You can switch from one back end to the other on the fly. You can switch the back end in the system configuration, and then run this command line utility to put the articles from the database onto the file system or the other way around:
pt_br: Você pode alternar de um back-end para outro em tempo real. Você pode alternar o back-end na configuração do sistema e, em seguida, executar este utilitário de linha de comando para colocar os artigos do banco de dados no sistema de arquivos ou vice-versa:
zh_hans: 您可以即时从一个后端切换到另一个。您可以在系统配置中切换后端，然后运行此命令行实用程序将物品从数据库放到文件系统上，或者以其他方式：

source: You can use the ``--target`` option to specify the target back end.
pt_br: Você pode usar o ``--target`` opção para especificar o backend de destino.
zh_hans: 您可以使用 ``--target`` 选项指定目标后端。

source: The entire process can take considerable time to run, depending on the number of articles you have and the available CPU power and/or network capacity.
pt_br: Todo o processo pode levar um tempo considerável para ser executado, dependendo do número de artigos que você possui e da energia da CPU disponível e / ou capacidade da rede.
zh_hans: 根据您拥有的物品数量、可用的CPU能力和/或网络容量，整个过程可能需要花费大量时间才能运行。

source: If you want to keep old attachments in the database, you can activate the system configuration option ``Ticket::Article::Backend::MIMEBase::CheckAllStorageBackends`` to make sure OTOBO will still find them.
pt_br: Se você deseja manter anexos antigos no banco de dados, pode ativar a opção de configuração do sistema ``Ticket::Article::Backend::MIMEBase::CheckAllStorageBackends`` para garantir que o OTOBO ainda os encontre.
zh_hans: 如果要将旧附件保留在数据库中，则可以激活系统配置选项``Ticket :: Article :: Backend :: MIMEBase :: CheckAllStorageBackends``以确保OTOBO仍然可以找到它们。

source: Archiving Tickets
pt_br: Arquivando Tickets
zh_hans: 封存工单

source: As OTOBO can be used as an audit-proof system, deleting closed tickets may not be a good idea. Therefore there is a feature that allows you to archive tickets.
pt_br: Como o OTOBO pode ser usado como um sistema à prova de auditoria, excluir tickets fechados pode não ser uma boa ideia. Portanto, há um recurso que permite arquivar tickets.
zh_hans: 由于OTOBO的数据可用作审查证据，因此删除已关闭的工单可能不是一个好主意，这项功能可让您封存工单。

source: Tickets that match certain criteria can be marked as archived. These tickets are not accessed if you do a regular ticket search or run a generic agent job. The system itself does not have to deal with a huge amount of tickets any longer as only the latest tickets are taken into consideration when using OTOBO. This can result in a huge performance gain on large systems.
pt_br: Os tickets que correspondem a determinados critérios podem ser marcados como arquivados. Esses tickets não serão acessados se você fizer uma pesquisa regular de tickets ou executar um trabalho de agente genérico. O sistema em si não precisa mais lidar com uma quantidade enorme de tickets, pois apenas os tickets mais recentes são levados em consideração ao usar o OTOBO. Isso pode resultar em um enorme ganho de desempenho em sistemas grandes.
zh_hans: 符合特定条件的故障单可以标记为已存档。这样在你进行常规工单搜索或进行常规话务员工作时，不会访问这些工单。这样系统不再需要处理大量旧工单，而是仅考虑最新的工单，这可以在大型系统上获得巨大的性能提升。

source: To use the archive feature:
pt_br: Para usar o recurso de arquivamento:
zh_hans: 要使用存档功能：

source: Activate the ``Ticket::ArchiveSystem`` setting in the system configuration.
pt_br: Ative a configuração ``Ticket::ArchiveSystem``nas Configurações de Sistema.
zh_hans: 在系统配置中激活 ``Ticket::ArchiveSystem``设置。

source: Define a generic agent job:
pt_br: Defina uma tarefa do agente genérico:
zh_hans: 定义通用话务员工作：

source: Click on the *Add Job* button in the *Generic Agent* screen.
pt_br: Clique no botão *Adicionar Tarega* na tela *Atendente genérico*.
zh_hans: 单击*通用话务员*屏幕中的*添加工作*按钮。

source: *Job Settings*: provide a name for the archiving job.
pt_br: *Configurações da tarefa* forneça um nome para o trabalho de arquivamento.
zh_hans: *工作配置*：为封存工作提供一个名字。

source: *Automatic Execution*: select proper options to schedule this job.
pt_br: *Execução automática*: selecione as opções apropriadas para agendar essa tarefa.
zh_hans: *自动化执行*：为工作的时间安排选择合适的选项。

source: *Select Tickets*: it might be a good idea to only archive those tickets in a closed state that have been closed a few months before.
pt_br: *Selecionar chamados*: Pode ser uma boa ideia arquivar apenas os tickets em um estado fechado que foram fechados há alguns meses antes.
zh_hans: *选择票证*：最好只归档几个月前就已经完成关闭的那些工单。

source: *Update/Add Ticket Attributes*: set the field *Archive selected tickets* to *archive tickets*.
pt_br: *Alterar/Adicionar Atributos do Chamado*: defina o campo*Arquivar chamados selecionados* to *Arquivar os chamados*.
zh_hans: *更新/添加工单属性*：将字段*将所选工单存档*设置为*存档工单*。

source: Save the job at the end of the page.
pt_br: Salve a tarefa no final da página.
zh_hans: 将工作保存在页面末尾。

source: Click on the *Run this task* link in the overview table to see the affected tickets.
pt_br: Clique no link * Executar esta Tarefa * na tabela de visão geral para ver os tickets afetados.
zh_hans: 单击概述表中的*运行此任务*的链接，查看受到影响的工单。

source: Click on the *Run Job* button.
pt_br: Clique no botão *Executar Tarefa*.
zh_hans: 点击*运行工作*按钮。

source: Up to 5000 tickets can be modified by running this job manually.
pt_br: Até 5000 tickets podem ser modificados executando esta tarefa manualmente.
zh_hans: 手动运行这项工作最多可以修改5000张工单。

source: When you search for tickets, the system default is to search tickets which are not archived.
pt_br: Ao procurar tickets, o padrão do sistema é procurar tickets que não estão arquivados.
zh_hans: 搜索工单时，系统默认只搜索未归档的工单。

source: To search for archived tickets:
pt_br: Para procurar tickets arquivados:
zh_hans: 要搜索已经归档的工单：

source: Open the ticket search screen.
pt_br: Abra a tela de pesquisa de tickets.
zh_hans: 打款工单搜索界面。

source: Set *Archive search* to *Unarchived tickets* or *All tickets*.
pt_br: Defina *Procurar Arquivo* como *Tickets não arquivados* ou * Todos os tickets *.
zh_hans: 将*归档搜索*设置为*未归档工单*或者*所有工单*。

source: Perform the search.
pt_br: Realize a pesquisa.
zh_hans: 进行搜索。

source: Caching
pt_br: Armazenamento em cache
zh_hans: 缓存

source: A fast cache module is a great help in terms of performance. We recommend to use a Redis Cache server or to create a ramdisk.
pt_br: Um módulo de cache rápido é uma grande ajuda em termos de desempenho. Recomendamos usar um servidor Redis Cache ou criar um ramdisk.
zh_hans: 快速缓存模块在性能方面有很大的帮助，我们建议使用Redis Cache服务器或创建虚拟硬盘。

source: Install a Redis Cache Server
pt_br: Instale um servidor de cache Redis
zh_hans: 安装一个 Redis Cache服务器

source: Install Redis Server
pt_br: Instale servidor Redis
zh_hans: 安装Redis服务器

source: First of all you need to install the newest Redis Server. The easiest way is to `setup Redis <https://redis.io/topics/quickstart>`__ on the same host as OTOBO and binding it to its default port.
pt_br: Antes de tudo, você precisa instalar o mais novo servidor Redis. A maneira mais fácil é `setup Redis <https://redis.io/topics/quickstart>`__ no mesmo host que OTOBO esta instalado à sua porta padrão.
zh_hans: 首先，你需要安装最新的Redis服务器。最简单的方法是在与OTOBO相同的主机上`配置Redis <https://redis.io/topics/quickstart>`__并将其绑定到其默认端口。

source: Install Perl module Redis or Redis::Fast
pt_br: Instale o módulo Perl Redis ou Redis::Fast
zh_hans: 安装Redis Perl 模块或者Redis::Fast

source: You can choose which Redis module to use: `Redis` or `Redis::Fast` (which is compatible with `Redis` but **~2x faster**). Please use ``otobo.CheckModules.pl --list`` to choose the right package for you:
pt_br: Você pode escolher qual módulo Redis usar: `Redis` ou`Redis::Fast` (que é compatível com `Redis` mas **~2x faster**). Por favor use nosso ``otobo.CheckModules.pl --list`` para escolher o pacote certo para você:
zh_hans: 你可以选择要使用的Redis模块：`Redis`或`Redis :: Fast`（与`Redis`兼容，但**快2倍**）。请使用我们的``otobo.CheckModules.pl --list`` 为您选择合适的软件包：

source: Configure OTOBO for Redis
pt_br: Configurar OTOBO para Redis
zh_hans: 为Redis进行OTOBO设置

source: Please use the OTOBO `SysConfig` (Admin -> System Configuration) to configure OTOBO properly:
pt_br: Por favor, use o OTOBO `SysConfig` (Administração-> Configuração do sistema) para configurar o OTOBO corretamente:
zh_hans: 请使用OTOBO`SysConfig`（管理员->系统配置）正确配置OTOBO：

source: RamDisk Caching
pt_br: Cache do RamDisk
zh_hans: 虚拟磁盘缓存

source: OTOBO caches a lot of temporary data in ``/opt/otobo/var/tmp``. Please make sure that this uses a high performance file system and storage. If you have enough RAM, you can also try to put this directory on a ramdisk like this:
pt_br: O OTOBO armazena muitos dados de cache temporários no ``/opt/otobo/var/tmp``. Verifique se ele usa um sistema de arquivos e armazenamento de alto desempenho. Se você possui RAM suficiente, também pode tentar colocar este diretório em um ramdisk como este:
zh_hans: OTOBO在/ opt / otobo / var / tmp中缓存了许多临时数据，请确保这里使用的是高性能的文件和存储系统。如果你有足够的RAM，也可以尝试将此目录放在如下所示的虚拟磁盘上：

source: Add persistent mount point in ``/etc/fstab``.
pt_br: Adicione ponto de montagem persistente no ``/etc/fstab``.
zh_hans: 在``/ etc / fstab``中添加持久挂载点。

source: This will be a non-permanent storage that will be lost on server reboot. All your sessions (if you store them in the file system) and your cache data will be lost.
pt_br: Este será um armazenamento não permanente que será perdido na reinicialização do servidor. Todas as suas sessões (se você as armazenar no sistema de arquivos) e os dados do cache serão perdidos.
zh_hans: 这不是一个永久性存储，将会在服务器重启时丢失，从而你的所有会话（如果你将它们存储在文件系统中）和缓存数据都会丢失。

source: For very high loads, it can be required to operate OTOBO on a cluster of multiple front end servers. This is a complex task with many pitfalls. We strongly advise to get in touch with our experts before trying to implement this on your own.
pt_br: Para cargas muito altas, pode ser necessário operar o OTOBO em um cluster de vários servidores front-end. Esta é uma tarefa complexa com muitas armadilhas. É altamente recomendável entrar em contato com nossos especialistas antes de tentar implementar isso por conta própria.
zh_hans: 对于非常高的生产负载，可能需要在多个前端服务器的群集上运行OTOBO，这项工作很复杂，也有很多陷阱。因此，Rother OSS专门在其 `管理OTOBO <https://otobo.de/>`__ 环境中为集群应用提供支持。

source: Hardware and Software Requirements
pt_br: Requisitos de Hardware e Software
zh_hans: 软硬件要求

source: OTOBO can be installed on Linux and other Unix derivates (e.g. OpenBSD or FreeBSD). Running OTOBO on Microsoft Windows is not supported.
pt_br: O OTOBO pode ser instalado no Linux e outros derivados do Unix (por exemplo, OpenBSD ou FreeBSD). A execução do OTOBO no Microsoft Windows não é suportada.
zh_hans: OTOBO可以安装在Linux和其他Unix派生版本（例如OpenBSD或FreeBSD）上，不支持在Microsoft Windows上运行OTOBO。

source: To run OTOBO, you'll also need to use a web server as reverse proxy and a database server. Apart from that, you should install Perl and/or install some additional Perl modules on the OTOBO machine.
pt_br: Para executar o OTOBO, você também precisará usar um servidor da Web como proxy reverso e um servidor de banco de dados. Além disso, você deve instalar o Perl e/ou instalar alguns módulos adicionais do Perl na máquina OTOBO.
zh_hans: 要运行OTOBO，需要使用一个Web服务器作为反向代理和一个数据库服务器。除此之外，您应该在OTOBO主机上安装Perl和/或一些其他Perl模块。

source: Perl must be installed on the same machine as OTOBO. The database back end and the web server may be installed locally or on another host.
pt_br: O Perl deve estar instalado na mesma máquina que o OTOBO. O back-end do banco de dados e o servidor da web podem ser instalados localmente ou em outro host.
zh_hans: Perl必须与OTOBO安装在同一台计算机上。数据库后端和Web服务器可以安装在本地或其他主机上。

source: For Perl, you will need some additional modules which can be installed either with Perl from CPAN, or via the package manager of your operating system (rpm, yast, apt-get).
pt_br: Para o Perl, você precisará de alguns módulos adicionais que podem ser instalados com o Perl do CPAN ou através do gerenciador de pacotes do seu sistema operacional (rpm, yast, apt-get).
zh_hans: 对于Perl，你还需要一些其他模块，这些模块可以与CPAN的Perl一起安装，也可以通过操作系统的软件包管理器（rpm，yast，apt-get）进行安装。

source: OTOBO has also a console command for missing modules.
pt_br: O OTOBO também possui um comando de console para módulos ausentes.
zh_hans: OTOBO也有一个控制台命令，用于检查缺失的模块。

source: If some packages are missing, you can get an install command for your operating system if you run the script with ``--list`` option.
pt_br: Se alguns pacotes estiverem ausentes, você poderá obter um comando de instalação para o seu sistema operacional se executar o script com a opção ``--list``.
zh_hans: 如果缺少某些软件包，可以用``--list``选项运行脚本，获取操作系统的安装命令。

source: The listed commands should then be executed with root privileges.
pt_br: Os comandos listados devem ser executados com privilégios de root.
zh_hans: 将以root权限执行列出的命令。

source: The output of the module check script shows the installed packages and the version numbers. Missing modules are marked with a comment.
pt_br: A saída do script de verificação do módulo mostra os pacotes instalados e os números da versão. Os módulos ausentes estão marcados com um comentário.
zh_hans: 模块检查脚本的输出，会显示已安装的软件包和版本号。缺失的模块会带着注释。

source: Hardware Requirements
pt_br: Requisitos de Hardware
zh_hans: 硬件要求

source: Hardware requirements highly depend on the usage of OTOBO. OTOBO can be used to process a few tickets per month or to process hundreds of tickets per day. The storage requirement also depends on the number of tickets and size of attachments.
pt_br: Os requisitos de hardware dependem muito do uso do OTOBO. O OTOBO pode ser usado para processar alguns tickets por mês ou para processar centenas de tickets por dia. O requisito de armazenamento também depende do número de tickets e do tamanho dos anexos.
zh_hans: 硬件要求在很大程度上取决于OTOBO的使用情况，因为 OTOBO可以用于每月处理几张工单，或着每天处理数百张工单。而其存储要求还取决于工单的数量和附件的尺寸。

source: We recommend using a machine for testing purposes with **at least**:
pt_br: Recomendamos o uso de uma máquina para fins de teste com **pelo menos**:
zh_hans: 我们建议使用一台计算机进行测试并**至少**具备以下条件：

source: We recommend using a machine for production purpose with **at least**:
pt_br: Recomendamos o uso de uma máquina para fins de produção com **pelo menos**:
zh_hans: 我们建议为生产环境准备一台计算机，并**至少**具备以下条件：

source: 3 GHz Xeon or comparable CPU
pt_br: CPU 3 GHz Xeon ou comparável
zh_hans: 3 GHz Xeon 或兼容的 CPU

source: 8 GB RAM (16 GB recommend)
pt_br: 8 GB RAM (16 GB recomendado)
zh_hans: 8 GB 内存 （建议 16 GB）

source: 40 GB storage
pt_br: 40 GB armazenamento
zh_hans: 40 GB 存储空间

source: Hardware requirements depend on the usage of OTOBO. Please contact your OTOBO consultant before deploying any hardware.
pt_br: Os requisitos de hardware dependem do uso do OTOBO. Entre em contato com seu consultor OTOBO antes de implantar qualquer hardware.
zh_hans: 硬件要求取决于OTOBO的使用，请在部署任何硬件之前，联系你的OTOBO顾问。

source: Software requirements
pt_br: Requisitos de software
zh_hans: 软件要求

source: Perl 5.24.0 or higher
pt_br: Perl 5.24.0 ou superior
zh_hans: Perl 5.24.0 或更高版本

source: Perl packages listed by ``/opt/otobo/bin/otobo.CheckModules.pl`` console command
pt_br: Pacotes Perl listados pela linha de comando ``/opt/otobo/bin/otobo.CheckModules.pl``
zh_hans: 控制台命令``/opt/otobo/bin/otobo.CheckModules.pl``会列出Perl软件包

source: Web Servers
pt_br: Servidores Web
zh_hans: Web服务器

source: Any other web server that can be used as a reverse proxy
pt_br: Qualquer outro servidor da web que possa ser usado como proxy reverso
zh_hans: 任何其他的可以用作反向代理的Web服务器

source: Databases
pt_br: Bases de dados
zh_hans: 数据库

source: MySQL 5.6 or higher
pt_br: MySQL 5.6 ou superior
zh_hans: MySQL 5.6或更高版本

source: PostgreSQL 9.2 or higher
pt_br: PostgreSQL 9.2 ou superior
zh_hans: PostgreSQL 9.2 或更高版本

source: Oracle 10g or higher
pt_br: Oracle 10g ou superior
zh_hans: Oracle 10g 或更高版本

source: Optional
pt_br: Opcional
zh_hans: 可选

source: Elasticsearch 7.x (fast search function for live previews)
pt_br: Elasticsearch 7.x (função de pesquisa rápida para pré-visualizações ao vivo)
zh_hans: Elasticsearch 7.x（实时预览的快速搜索功能）

source: Node.js 8.9 or higher (only for development)
pt_br: Node.js 8.9 or higher (apenas para desenvolvimento)
zh_hans: Node.js 8.9 或更高版本（仅用于开发）

source: Web browsers
pt_br: Navegadores
zh_hans: 网络浏览器
