Repository: Monviech/otobo-doc-otobo-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: pt_br, zh_hans

source: Backup and Restore
pt_br: Backup e Restauração
zh_hans: 备份和恢复

source: OTOBO has built in scripts for backup and restore. Execute the scripts with the option ``-h`` for more information.
pt_br: OTOBO possui scripts internos para backup e restauração. Execute os scripts com a opção ``-h`` para obter mais informações.
zh_hans: OTOBO有内置的脚本用于备份和恢复，执行脚本时加入``-h``可以看到更详细的信息。

source: To create a new backup, write permission for the destination directory is needed for the user ``otobo``.
pt_br: Para criar um backup, é necessário permissão de gravação para o usuário ``otobo`` no diretório de destino.
zh_hans: 创建一个新的备份，需要用户 ``otobo``具备对目的目录有写的权限。

source: The output of the script:
pt_br: Saída do script:
zh_hans: 脚本的输出结果为：

source: Restore
pt_br: Restaurar
zh_hans: 恢复

source: To restore the database make sure that the database ``otobo`` exists and contains no tables.
pt_br: Para restaurar o banco de dados, certifique-se de que o banco de dados ``otobo`` existe e não contém tabelas.
zh_hans: 恢复数据库时，请确认数据库``otobo`` 存在并且不包含表单。

source: Considerations for running OTOBO under Docker
pt_br: Considerações para executar OTOBO no Docker
zh_hans: 在Docker下运行OTOBO的考量

source: The same scripts can be used with OTOBO running under Docker. However some Docker specific limitation must be considered.
pt_br: Os mesmos scripts podem ser usados com OTOBO em execução no Docker. No entanto, algumas limitações específicas do Docker devem ser consideradas.
zh_hans: 相同的脚本可以用于OTOBO在Docker下的运行，不过要考虑一些Docker特定的限制。

source: First we need to make sure that the backup files are not created in the file system that is internal to the container. Because in that case all data would be lost when the container is stopped. Therefore the backup directory must be in a volume. For now we only consider the most simple case, where the backup dir is a local dir on the Docker host. The location of the backup dir in the container can be arbitrarily chosen. In this example we choose the local dir ``otobo_backup`` as the location on the host, and ``/otobo_backup`` as the location in the container.
pt_br: Primeiro, precisamos nos certificar de que os arquivos de backup não sejam criados no sistema de arquivos interno do contêiner. Porque nesse caso todos os dados seriam perdidos quando o contêiner fosse interrompido. Portanto, o diretório de backup deve estar em um volume. Por enquanto, consideramos apenas o caso mais simples, em que o diretório de backup é um diretório local no host Docker. A localização do diretório de backup no contêiner pode ser escolhida arbitrariamente. Neste exemplo, escolhemos o diretório local ``otobo_backup`` como o local no host, e ``/otobo_backup`` como o local no contêiner.
zh_hans: 首先我们要确认备份文件创建时所在的文件系统，不是一个容器内部的文件系统。因为在那种情况下，当容器被停止后，所有的数据都会丢失。所以，备份目录必须在一个卷。现在我们先考虑最简单的一种情况，备份目录是Docker主机的一个本地目录。备份目录在容器中的位置可以随意选择。在本例中我们选择本地目录``otobo_backup``作为备份目录在主机的位置， 而在容器中的位置就是``/otobo_backup`` 。

source: First we need to create the volume.
pt_br: Primeiro, precisamos criar o volume.
zh_hans: 首先我们需要创建卷。

source: For creating the backup we need a running database and the volumes ``otobo_opt_otobo`` and ``otobo_backup``. This means that the webserver and the Daemon may, but don't have to, be stopped.
pt_br: Para criar o backup, precisamos de um banco de dados em execução e os volumes ``otobo_opt_otobo`` e ``otobo_backup``. Isso significa que o servidor da Web e o Daemon podem, mas não precisam, ser interrompidos.
zh_hans: 为了创建备份，我们需要一个运行的数据库和卷``otobo_opt_otobo`` 以及 ``otobo_backup``，这意味着网站服务器和Daemon可能，不是必须，被停掉。

source: For restoring the backup we also need to specify which backup should be restored. The placeholder ``<TIMESTAMP>`` is something like ``2020-09-07_09-38``.
pt_br: Para restaurar o backup, também precisamos especificar qual backup deve ser restaurado. O placeholder ``<TIMESTAMP>`` é algo como ``2020-09-07_09-38``.
zh_hans: 为了把备份文件恢复回来，我们需要确认恢复哪个备份文件。占位符``<TIMESTAMP>`` 就如同``2020-09-07_09-38``的标记一样。

source: Backup and Restore using Docker
pt_br: Backup e Restauração usando Docker
zh_hans: 备份和恢复

source: Please read to the chapter :doc:`backup-restore` for basic information about the backup and restore scripts.
pt_br: Por favor, leia o capítulo :doc:`backup-restore` para informações básicas sobre os scripts de backup e restauração.

source: The standard scripts ``backup.pl`` and ``restore.pl`` can also be used with OTOBO running under Docker. However some Docker specific limitations have to be considered.
pt_br: Os scripts padrão ``backup.pl`` e ``restore.pl`` também podem ser usados com OTOBO rodando no Docker. No entanto, algumas limitações específicas do Docker devem ser consideradas.

source: First, we need to make sure that the backup files are not created in the file system that is internal to a Docker container. Because in that case the created files would be lost when the container is stopped. This means that the backup directory must located within in a volume. For this manual we only consider the most simple case, where the backup directory is a local directory on the Docker host. The location of the backup dir in the container can be arbitrarily chosen. In this example we choose the local dir ``otobo_backup`` as the location on the host and ``/otobo_backup`` as the location in the container.
pt_br: Primeiro, precisamos nos certificar de que os arquivos de backup não sejam criados no sistema de arquivos interno de um contêiner do Docker. Porque, nesse caso, os arquivos criados seriam perdidos quando o contêiner for interrompido. Isso significa que o diretório de backup deve estar localizado em um volume. Para este manual, consideramos apenas o caso mais simples, em que o diretório de backup é um diretório local no host Docker. A localização do diretório de backup no contêiner pode ser escolhida arbitrariamente. Neste exemplo, escolhemos o dir local ``otobo_backup`` como o local no host e ``/otobo_backup`` como o local no contêiner.

source: Secondly, commands in the Docker container usually run as the user `otobo` with the user id 1000 and the group id 1000. It must be made sure, that this user can write in the backup directory.
pt_br: Em segundo lugar, os comandos no contêiner Docker geralmente são executados como o usuário `otobo` com a id de usuário 1000 e a id de grupo 1000. Deve-se ter certeza de que este usuário pode escrever no diretório de backup.

source: For creating the backup we need a running database and the volumes ``otobo_opt_otobo`` and ``otobo_backup``. This means that the webserver and the OTOBO daemon may, but don't have to, be stopped.
pt_br: Para criar o backup, precisamos de um banco de dados em execução e os volumes ``otobo_opt_otobo`` e ``otobo_backup``. Isso significa que o servidor da web e o daemon OTOBO podem, mas não precisam, ser parados.

source: Documentation History
pt_br: Histórico da documentação
zh_hans: 文档历史

source: 2019 - OTRS Installation Guide - OTRS AG (https://otrs.com)
pt_br: 2019 - OTRS Guia de instalação - OTRS AG (https://otrs.com)
zh_hans: 2019 - OTRS安装指南 - OTRS AG (https://otrs.com)

source: 2020 - OTOBO Installation Tutorial - Rother OSS GmbH (https://otobo.de)
pt_br: 2020 - OTOBO Manual de instalação - Rother OSS GmbH (https://otobo.de)
zh_hans: 2020 - OTOBO安装教程 - Rother OSS GmbH (https://otobo.de)

source: Published by: Rother OSS GmbH, (https://otobo.de), Oberwalting 31, 94339 Leiblfing, Germany. Authors: OTRS AG (original version), Rother OSS GmbH (https://otobo.de)
pt_br: Publicado por: Rother OSS GmbH, (https://otobo.de), Oberwalting 31, 94339 Leiblfing, Germany. Authors: OTRS AG (original version), Rother OSS GmbH (https://otobo.de)
zh_hans: 由Rother OSS GmbH出版，地址：德国莱布芬市 Oberwalting 31, 94339。作者：OTRS AG (original version)，Rother OSS GmbH (https://rother-oss.com)

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license can be found on the `GNU website <https://www.gnu.org/licenses/fdl-1.3.txt>`__.
pt_br: É concedida permissão para copiar, distribuir e/ou modificar este documento sob os termos da GNU Free Documentation License, Versão 1.3 ou qualquer versão posterior publicada pela Free Software Foundation; sem secções Invariantes, sem textos de capa e sem textos de contracapa. Uma cópia da licença pode ser encontrada no site `GNU <https://www.gnu.org/licenses/fdl-1.3.txt>` __.
zh_hans: 在GNU免费文档许可条款（版本1.3或之后由自由软件基金会发布更新版）的要求下，没有不变动的章节，没有前后封面文字。授权文件可以在`GNU网站：<https://www.gnu.org/licenses/fdl-1.3.txt>`上找到。

source: OTOBO Installation Tutorial
pt_br: Manual de Instalação do OTOBO
zh_hans: OTOBO安装教程

source: This work is copyrighted by OTRS AG (https://otrs.com), Zimmersmühlenweg 11, 61440 Oberursel, Germany.
pt_br: Este trabalho é protegido por direitos autorais OTRS AG (https://otrs.com), Zimmersmühlenweg 11, 61440 Oberursel, Germany.
zh_hans: 本著作版权属于OTRS AG (https://otrs.com), Zimmersmühlenweg 11, 61440 Oberursel, Germany.

source: Copyright © for modifications and amendments 2019-2020 ROTHER OSS GmbH (https://otobo.de), Oberwalting 31, 94339 Leiblfing, Germany
pt_br: Direitos Autorais © para modificações e emendas 2019-2020 ROTHER OSS GmbH (https://otobo.de), Oberwalting 31, 94339 Leiblfing, Germany
zh_hans: 2019-2020更改和修订版权：ROTHER OSS GmbH (https://otobo.de), Oberwalting 31, 94339 Leiblfing, Germany

source: Terms and Conditions OTRS: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license can be found on the GNU website.
pt_br: Termos e Condições OTRS: É concedida permissão para copiar, distribuir e/ou modificar este documento sob os termos da GNU Free Documentation License, Versão 1.3 ou qualquer versão posterior publicada pela Free Software Foundation; sem secções Invariantes, sem textos de capa e sem textos de contracapa. Uma cópia da licença pode ser encontrada no site `GNU <https://www.gnu.org/licenses/fdl-1.3.txt>` __.
zh_hans: OTRS条款：在GNU免费文档许可条款（版本1.3或之后由自由软件基金会发布更新版）的要求下，没有不变动的章节，没有前后封面文字。授权文件的拷贝可以在`GNU网站上找到。

source: Terms and Conditions Rother OSS: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license is included in the section entitled "COPYING".
pt_br: Termos e Condições Rother OSS: É concedida permissão para copiar, distribuir e / ou modificar este documento sob os termos da GNU Free Documentation License, Versão 1.3 ou qualquer versão posterior publicada pela Free Software Foundation; sem seções invariantes, sem textos de capa e sem textos de contracapa. Uma cópia da licença está incluída na seção "CÓPIA".
zh_hans: Rother OSS条款：在GNU免费文档许可条款（版本1.3或之后由自由软件基金会发布更新版）的要求下，没有不变动的章节，没有前后封面文字。授权文件可以在GNU网站上找到。

source: Published by: Rother OSS GmbH, (https://otobo.de), Oberwalting 31, 94339 Leiblfing, Germany.
pt_br: Publicado por: Rother OSS GmbH, (https://otobo.de), Oberwalting 31, 94339 Leiblfing, Germany.
zh_hans: 出版人：Rother OSS GmbH, (https://otobo.de), Oberwalting 31, 94339 Leiblfing, Germany.

source: Authors: OTRS AG (original version), Rother OSS GmbH (https://otobo.de).
pt_br: Autores: OTRS AG (versão original), Rother OSS GmbH (https://otobo.de).
zh_hans: 作者：OTRS AG (original version), Rother OSS GmbH (https://otobo.de)。

source: Contents
pt_br: Conteúdo
zh_hans: 内容

source: OTOBO Installation
pt_br: Instalação do OTOBO
zh_hans: OTOBO安装

source: This chapter describes the installation and basic configuration of the central OTOBO framework.
pt_br: Este capítulo descreve a instalação e a configuração básica da estrutura central do OTOBO.
zh_hans: 本章讲述了OTOBO构架核心部分的安装和基本设置。

source: Follow the detailed steps in this chapter to install OTOBO on your server. You can then use its web interface to login and administer the system.
pt_br: Siga as etapas detalhadas neste capítulo para instalar o OTOBO no seu servidor. Você pode usar sua interface da web para efetuar login e administrar o sistema.
zh_hans: 按照本章的详细步骤在你的服务器上安装OTOBO，而后你就可以从网络接口登陆并管理系统了。

source: Preparation: Disable SELinux when it is installed and enabled
pt_br: Preparação: Desative SELinux quando estiver instalado e ativado
zh_hans: 准备工作：SELinux完成安装和激活后，关闭它

source: If your system uses SELinux, you should disable it, otherwise OTOBO will not work correctly.
pt_br: Se seu sistema usa o SELinux, você deve desativa-lo, caso contrário o OTOBO não funcionará corretamente.
zh_hans: 如果你的系统是SELinux，需要禁用它，否则OTOBO不能正确运行。

source: Try the command ``sestatus`` and ``getenforce`` when you are not sure whether SELinux is installed and enabled on your system.
pt_br: Tente os comandos``sestatus`` e `getenforce`` quando você não tiver certeza se o SELinux está instalado e ativado no seu sistema.
zh_hans: 如果你不能确认SELinux是否已经在你的系统上安装激活，可以试一下命令``sestatus`` 和 ``getenforce`` 。

source: The ``sestatus`` command returns the SELinux status and the SELinux policy being used. SELinux status: enabled is returned when SELinux is enabled. Current mode: enforcing is returned when SELinux is running in enforcing mode. Policy from config file: targeted is returned when the SELinux targeted policy is used.
pt_br: O comando ``sestatus`` retorna o estado do SELinux e a política do SELinux que está sendo usada. Estado do SELinux: enabled é retornado quando o SELinux está ativado. Modo atual: enforcing é retornada quando o SELinux está sendo executado no modo enforcing. Política do arquivo de configuração: target é retornada quando a política de destino do SELinux é usada.
zh_hans: 命令``sestatus`` 可以返回SELinux的状态和应用的策略。SELinux的状态如果返回“被激活”，就说明SELinux已经激活；当前模式如果返回“强制模式”就说明SELinux是运行在强制模式下；配置文件策略如果返回“目标”，就说明SELinux的目标策略已经激活。

source: Here's how to disable SELinux for RHEL/CentOS/Fedora.
pt_br: Veja como desativar o SELinux para RHEL/CentOS/Fedora.
zh_hans: 这里是如何在RHEL/CentOS/Fedora中禁用SELinux。

source: Configure ``SELINUX=disabled`` in the ``/etc/selinux/config`` file:
pt_br: Configurar ``SELINUX=disabled`` no arquivo ``/etc/selinux/config`` :
zh_hans: 在``/etc/selinux/config``文件中设置 ``SELINUX=disabled``：

source: Reboot your system. After reboot, confirm that the ``getenforce`` command returns *Disabled*:
pt_br: Reinicie seu sistema. Após reiniciar, confirme que o comando``getenforce`` retorne *Disabled*:
zh_hans: 重启你的系统，重启后，确认一下``getenforce`` 命令返回的是不是“禁用”：

source: Step 1: Unpack and Install OTOBO
pt_br: Passo 1: Desempacotar e Instalar o OTOBO
zh_hans: 步骤1：打开OTOBO封装和安装

source: Download the latest otobo release from https://ftp.otobo.org/pub/otobo/. Unpack the source archive (for example, using ``tar``) into the directory ``/opt/otobo-install``:
pt_br: Baixe a última versão do otobo em https://ftp.otobo.org/pub/otobo/. Descompacte o arquivo fonte (por exemplo, usando``tar``) dentro do diretório ``/opt/otobo-install``:
zh_hans: 从https://ftp.otobo.org/pub/otobo/下载最新的OTOBO版本软件，打开封装文档（例如使用``tar``命令），并存到目录``/root/otobo-update``：

source: Step 2: Install Additional Programs and Perl Modules
pt_br: Passo 2: Instale Programas Adicionais e Módulos Perl
zh_hans: 步骤2：安装其他程序和Perl模块

source: Use the following script to get an overview of all installed and required CPAN modules and other external dependencies.
pt_br: Use o seguinte script para obter uma visão geral de todos os módulos CPAN instalados e requeridos e outros dependências externas.
zh_hans: 用下面的脚本可以对所有已经安装的，以及必须要的CPAN模块和其他外部环境，有一个通盘的了解。

source: Please note that OTOBO requires a working Perl installation with all *core* modules such as the module ``version``. These modules are not explicitly checked by the script. You may need to install a ``perl-core`` package on some systems like RHEL that do not install the Perl core packages by default.
pt_br: Observe que o OTOBO requer uma instalação funcionando do Perl com todos os módulos *core*, como o módulo ``version``. Esses módulos não são explicitamente verificados pelo script. Pode ser necessário instalar um pacote ``perl-core`` em alguns sistemas como o RHEL que não instalam os pacotes principais do Perl por padrão.
zh_hans: 请注意OTOBO需要一个安装了所有*核心*模块的可以运行的Perl，例如``version``模块。脚本不会对这些模块进行核查，所以针对一些像RHEL的系统，他们不会去默认安装Perl核心模块，你可能需要自己去安装这些 ``perl-core``软件包。

source: To install the required and optional packages, you can use either CPAN or the package manager of your Linux distribution.
pt_br: Para instalar os pacotes obrigatórios e opcionais, você pode usar o CPAN ou o gerenciador de pacotes da sua distribuição Linux.
zh_hans: 你可以用CPAN或者Linux的软件包管理系统，安装必须的以及可选的软件模块。

source: Execute this command to get an install command to install the missing dependencies:
pt_br: Execute este comando para obter um comando de instalação para instalar as dependências ausentes:
zh_hans: 执行这个命令就可以取得一个安装命令，去安装那些缺失的外部环境软件：

source: There are a number of optional or alternative modules which can be installed, mostly for more customized versions of OTOBO. Calling CheckModules.pl without any argument will list its full functionality.
pt_br: Existem vários módulos opcionais ou alternativos que podem ser instalados, principalmente para versões mais personalizadas do OTOBO. Chamar CheckModules.pl sem nenhum argumento listará sua funcionalidade completa.
zh_hans: 有一些可选的或者可替换的模块，在大多数定制化的OTOBO版本中，也可以安装上。调用CheckModules.pl 毫无疑问可以列出所有功能。

source: Step 3: Create the OTOBO User
pt_br: Passo 3: Crie o usuário OTOBO
zh_hans: 步骤3：创建OTOBO用户

source: Create a dedicated user for OTOBO within its own group:
pt_br: Crie um usuário dedicado para OTOBO dentro de seu próprio grupo:
zh_hans: 在用户自己的组中，创建一个专用的OTOBO用户：

source: Add the user to web server group (if the web server is not running as otobo user):
pt_br: Adicione o usuário no grupo do seu servidor web (se o seu servidor web não estiver rodando com o usuário otobo):
zh_hans: 把这个用户加入网站服务器组（如果网站服务器不是作为OTOBO用户运行）：

source: Step 4: Activate the Default Configuration File
pt_br: Passo 4: Ative o arquivo de configuração padrão
zh_hans: 步骤4：激活默认的配置文件

source: There is an OTOBO configuration file bundled in ``$OTOBO_HOME/Kernel/Config.pm.dist``. You must activate it by copying it without the ``.dist`` file name extension.
pt_br: Há um arquivo de configuração OTOBO incluído no ``$OTOBO_HOME/Kernel/Config.pm.dist``. Você deve ativa-lo copiando o arquivo sem a extensão do arquivo ``.dist``.
zh_hans: 有一个OTOBO配置文件是捆绑在``$OTOBO_HOME/Kernel/Config.pm.dist``中的，你需要拷贝这个文件并去掉``.dist`` ，以便激活它。

source: Step 5: Configure the Apache Web Server
pt_br: Passo 5: Configure seu servidor Web Apache
zh_hans: 步骤5：配置Apache网站服务器

source: First of all, you should install the Apache2 web server and mod_perl; you'd typically do this from your system's package manager. Below you'll find the commands needed to set up Apache on the most popular Linux distributions.
pt_br: Em primeiro lugar, você deve instalar o servidor Web Apache2 e o mod_perl; você normalmente faz isso no gerenciador de pacotes do seu sistema. Abaixo, você encontrará os comandos necessários para configurar o Apache nas distribuições Linux mais populares.
zh_hans: 首先，你需要安装Apache2网站服务器和mod_perl：通常你会通过系统的软件管理系统来进行。在下面你看会看到在当前流行的Linux版本上，安装Apache需要的一些命令。

source: OTOBO requires a few Apache modules to be active for optimal operation. On most platforms you can make sure they are active via the tool a2enmod.
pt_br: O OTOBO requer que alguns módulos Apache estejam ativos para uma operação ideal. Na maioria das plataformas, você pode garantir que elas estejam ativas através da ferramenta a2enmod.
zh_hans: OTOBO为了实现最优运行，需要一些Apache模块。在大多数平台上，你可以通过a2enmod工具确认这些模块是否已经激活。

source: On some platforms not all Apache modules exist and an error is displayed when installing. Do not worry and finish the installation, in most cases the module will not be needed.
pt_br: Em algumas plataformas, nem todos os módulos Apache existem e um erro será exibido durante a instalação. Não se preocupe e termine a instalação, na maioria dos casos o módulo não será necessário.
zh_hans: 在一些平台上，不是所有的Apache模块都存在，这样在安装的时候就会显示错误信息。这种情况不用着急，继续完成安装，大部分情况下，没有成功安装的模块往往都不需要。

source: Most Apache installations have a ``conf.d`` directory included. On Linux systems you can usually find this directory under ``/etc/apache`` or ``/etc/apache2``.
pt_br: A maioria das instalações do Apache tem um diretório ``conf.d`` incluído. Em sistemas Linux, você geralmente pode encontrar este diretório em ``/etc/apache`` ou``/etc/apache2``.
zh_hans: 大部分的Apache安装都包括一个``conf.d``目录，在Linux系统中你可以在``/etc/apache`` 或者 ``/etc/apache2``下面找到这个目录。

source: Configure Apache without SSL support
pt_br: Configurar Apache sem suporte SSL
zh_hans: 在没有SSL支持的情况下配置Apache

source: Copy the appropriate template in ``/opt/otobo/scripts/apache2-httpd.include.conf`` to a file called ``zzz_otobo.conf`` in the Apache configuration directory (to make sure it is loaded after the other configurations).
pt_br: Copie o modelo apropriado em ``/opt/otobo/scripts/apache2-httpd.include.conf`` para um arquivo chamado ``zzz_otobo.conf`` no diretório de configuração do Apache (para certificar-se de que seja carregado após as outras configurações).
zh_hans: 在Apache配置目录中（先确认一下在完成其他配置后是否被加载了），从``/opt/otobo/scripts/apache2-httpd.include.conf``拷贝合适的模板到文件``zzz_otobo.conf`` 。

source: Configure Apache **with** SSL support
pt_br: Configure o Apache **com** suporte SSL
zh_hans: 在 **有** SSL 支持的情况下配置Apache

source: Copy the template files ``/opt/otobo/scripts/apache2-httpd-vhost-80.include.conf`` and ``/opt/otobo/scripts/apache2-httpd-vhost-443.include.conf`` to the apache ``sites-available`` directory`.
pt_br: Copie os arquivos de modelo ``/opt/otobo/scripts/apache2-httpd-vhost-80.include.conf`` e ``/opt/otobo/scripts/apache2-httpd-vhost-443.include.conf`` para o diretório ``sites-availible`` .
zh_hans: 把模板文件 ``/opt/otobo/scripts/apache2-httpd-vhost-80.include.conf``和``/opt/otobo/scripts/apache2-httpd-vhost-443.include.conf`` 拷贝到Apache的``sites-available``目录下。

source: Please edit the files and add the required information like SSL certificate storage path. After that, enable the OTOBO Apache configuration:
pt_br: Edite os arquivos e adicione as informações necessárias, como o caminho de armazenamento do certificado SSL. Depois disso, ative a configuração do OTOBO Apache:
zh_hans: 请编辑文件并加入一些必须的信息，例如SSL认证存储路径。之后，激活OTOBO Apache配置：

source: Now you can restart your web server to load the new configuration settings. On most systems you can use the following command to do so:
pt_br: Agora você pode reiniciar o servidor da web para carregar as novas definições de configuração. Na maioria dos sistemas, você pode usar o seguinte comando para fazer isso:
zh_hans: 现在你可以重启你的网站服务器，载入新的配置设定了。在多数系统中，你可以用下面的命令来实现：

source: Step 6: Set File Permissions
pt_br: Passo 6: Configurando Permissões de Arquivos
zh_hans: 步骤6：设置文件许可

source: Please execute the following command to set the file and directory permissions for OTOBO. It will try to detect the correct user and group settings needed for your setup.
pt_br: Por favor, execute o seguinte comando para definir as permissões de arquivo e diretório para o OTOBO. Ele tentará detectar as configurações corretas de usuário e grupo necessárias para sua configuração.
zh_hans: 请执行下面的命令设置OTOBO的文件和目录许可。系统会尝试为你检测正确的用户和组。

source: Step 7: Setup the Database
pt_br: Passo 7: Configurando o Banco de Dados
zh_hans: 步骤7：建立数据库
