Repository: Monviech/otobo-doc-otobo-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: pt_br, zh_hans

source: ``docker-compose config`` check and show the configuration
pt_br: ``docker-compose config`` verifique e mostre a configuração
zh_hans: ``docker-compose config``检查并显示相应配置

source: ``docker-compose ps`` show the running containers
pt_br: ``docker-compose ps`` mostrar os contêineres em execução
zh_hans: ``docker-compose ps`` 显示正在运行的容器

source: Resources
pt_br: Recursos
zh_hans: 资源

source: Installing Perl modules
pt_br: Instalando módulos Perl
zh_hans: 安装Perl模块

source: When there are special requirements then the need for additional Perl modules may arise. Fortunately Perl has an excellent package repository that can satisfy almost all needs. That repository is called CPAN and is available at https://metacpan.org/.
pt_br: Quando há requisitos especiais, pode surgir a necessidade de módulos Perl adicionais. Felizmente, Perl tem um excelente repositório de pacotes que pode satisfazer quase todas as necessidades. Esse repositório é denominado CPAN e está disponível em https://metacpan.org/.
zh_hans: 如果有特殊要求，则可能需要其他Perl模块。幸运的是，Perl具有出色的软件包存储库，可以满足几乎所有需求。该存储库称为CPAN，可从https://metacpan.org/获得。

source: It is recommended that modules from CPAN are installed with the command line client ``cpanm``. Alternatively, many Perl modules are also available as packages for your operating system. These packages can be installed via your systems regular package manager.
pt_br: É recomendado que os módulos do CPAN sejam instalados com o cliente de linha de comando ``cpanm``. Como alternativa, muitos módulos Perl também estão disponíveis como pacotes para seu sistema operacional. Esses pacotes podem ser instalados através do gerenciador de pacotes regular do seu sistema.
zh_hans: 建议将CPAN中的模块与命令行客户端``cpanm''一起安装。另外，许多Perl模块也可以作为操作系统的软件包使用。可以通过您的系统常规软件包管理器来安装这些软件包。

source: The utility ``cpanm`` is often already installed on your system. Please see https://metacpan.org/pod/App::cpanminus for what to do when is isn't already available.
pt_br: O utilitário ``cpanm`` geralmente já está instalado em seu sistema. Consulte https://metacpan.org/pod/App::cpanminus para saber o que fazer quando ainda não estiver disponível.
zh_hans: 应用程序``cpanm''通常已经安装在您的系统上，如果没有，请参阅https://metacpan.org/pod/App::cpanminus的处理方法。

source: Per default ``cpanm`` installs module into a systemwide location. In this case modules must be installed as the root user. For example, the command
pt_br: Módulo de instalação ``cpanm`` padrão do Perl em um local do sistema. Nesse caso, os módulos devem ser instalados como usuário root. Por exemplo, o comando
zh_hans: 默认情况下，“ cpanm”会将模块安装到系统范围内的位置。在这种情况下，必须以root用户身份安装模块。例如，命令

source: results in:
pt_br: resulta em:
zh_hans: 结果是：

source: Special care must be taken when OTOBO runs within Docker. In this case, it seems an easy option to install the wanted module into the system Perl. However, due to how Docker works, this change would be lost when the container is restarted. Therefore the modules must be installed into a location that survives a restart. The local install location can be specified with the option ``--local-lib``. Installed modules will be found by Perl because of the environment variables ``PERL5LIB`` and ``PATH``, which are set-up accordingly in the Docker image.
pt_br: Cuidado especial deve ser tomado quando o OTOBO é executado no Docker. Neste caso, parece uma opção fácil instalar o módulo desejado no sistema Perl. No entanto, devido ao funcionamento do Docker, essa alteração seria perdida quando o contêiner fosse reiniciado. Portanto, os módulos devem ser instalados em um local que sobreviva a uma reinicialização. O local de instalação local pode ser especificado com a opção ``--local-lib``. Os módulos instalados serão encontrados pelo Perl por causa das variáveis de ambiente ``PERL5LIB`` E ``PATH``, que são configuradas de acordo com a imagem Docker.
zh_hans: 当OTOBO在Docker下运行时，必须格外小心。在这种情况下，所需的模块可以轻松地安装到系统Perl中。但是，由于Docker的工作方式，重新启动容器后，此更改将丢失。因此，必须将模块安装到可以重新启动的位置。本地安装位置可以使用选项--local-lib来指定。 Perl将找到已安装的模块，因为在Docker映像中已相应设置了环境变量“ PERL5LIB”和“ PATH”。

source: Introduction
pt_br: Introdução
zh_hans: 介绍

source: About This Manual
pt_br: Sobre esse manual
zh_hans: 关于本手册

source: This manual is intended for use by system administrators. The chapters describe the installation and updating of the OTOBO software.
pt_br: Este manual é destinado ao uso de administradores de sistema. Os capítulos descrevem a instalação e atualização do software OTOBO.
zh_hans: 本手册供系统管理员使用，本章介绍了OTOBO软件的安装和更新。

source: There is no graphical user interface for installation and updating. System administrators have to follow the steps described in the following chapters.
pt_br: Não há interface gráfica com o usuário para instalação e atualização. Os administradores de sistema precisam seguir as etapas descritas nos capítulos seguintes.
zh_hans: 没有用于安装和更新的图形用户界面。系统管理员必须按照以下章节中描述的步骤进行。

source: All console commands look like ``username> command-to-execute``. Username indicates the user account of the operating system, which need to use to execute the command. If a command starts with ``root>``, you have to execute the command as a user with root permissions. If a command starts with ``otobo>``, you have to execute the command as the user created for OTOBO.
pt_br: Todos os comandos do console se parecem com ``username> command-to-execute``. Nome de usuário indica a conta de usuário do sistema operacional, que precisa ser usada para executar o comando. Se um comando iniciar com ``root>``, você deverá executar o comando como um usuário com permissões de root. Se um comando iniciar com ``otobo>``, você deverá executar o comando como o usuário criado para o OTOBO.
zh_hans: 所有控制台命令看起来都是这种格式``username> command-to-execute``。其中用户名表示操作系统的用户帐户，需要使用该帐户来执行命令。如果命令以``root>''开头，则必须以具有root权限的用户身份执行命令。如果命令以“ʻotobo>”开头，则必须以为OTOBO创建的用户身份执行。

source: Do not select ``username>`` when you copy the command and paste it to the shell. Otherwise you will get an error.
pt_br: Não selecione ``username>``quando você copia o comando e o cola no shell. Caso contrário, você receberá um erro.
zh_hans: 复制命令并将其粘贴到外壳程序时，请勿选择``username>`` 。否则，您将得到一个错误警示。

source: Migration from OTRS / ((OTRS)) Community Edition version 6 to OTOBO version 10
pt_br: Migração do OTRS / ((OTRS)) Community Edition versão 6 para OTOBO versão 10
zh_hans: 从 OTRS / ((OTRS)) Community Edition version 6 转移到 OTOBO version 10

source: Welcome and thank you for choosing OTOBO!
pt_br: Bem-vindo e obrigado por escolher o OTOBO!
zh_hans: 欢迎并感谢大家选择OTOBO！

source: OTRS, ((OTRS)) Community Edition and OTOBO are very comprehensive and flexible in their application. Thus, every migration to OTOBO requires thorough preparation and possibly some rework, too.
pt_br: OTRS, ((OTRS)) Community Edition e OTOBO são muito abrangentes e flexíveis em sua aplicação. Portanto, toda migração para o OTOBO requer uma preparação completa e, possivelmente, algum retrabalho também.
zh_hans: OTRS，（（OTRS））Community Edition和OTOBO的应用都非常全面和灵活。因此，每次迁移OTOBO都需要进行充分的准备，甚至还可能需要一些返工。

source: Please take your time for the migration and follow these instructions step by step.
pt_br: Reserve um tempo para a migração e siga estas instruções passo a passo.
zh_hans: 请预留时间进行迁移，并逐步按照这些说明进行操作。

source: If you have any problem or question, please do not give up :) Call our support line, write an email, or post your query in the OTOBO Community forum at https://forum.otobo.org/.
pt_br: Se você tiver qualquer problema ou dúvida, por favor não desista :) Ligue para nossa linha de suporte, escreva um e-mail ou poste sua dúvida no fórum da Comunidade OTOBO em https://forum.otobo.org/.
zh_hans: 如果您有任何问题，请不要放弃:)致电我们的支持热线，写电子邮件或在OTOBO社区论坛（https://forum.otobo.org/）上发布您的需求。

source: We will find a way to help you.
pt_br: Nós vamos encontrar uma maneira de ajudá-lo.
zh_hans: 我们会想办法帮助你。

source: After the migration all data previously available in OTRS 6 will be available in OTOBO. We do not modify any OTRS data during the migration.
pt_br: Após a migração, todos os dados anteriormente disponíveis no OTRS 6 estarão disponíveis no OTOBO. Não modificamos nenhum dado OTRS durante a migração.
zh_hans: 迁移后，OTOS 6中以前可用的所有数据将在OTOBO中可用。在迁移期间，我们不会修改任何OTRS的任何数据。

source: Migration Possibilities
pt_br: Possibilidades de migração
zh_hans: 迁移的可能性

source: With the OTOBO Migration Interface it is possible to perform the following migrations:
pt_br: Com a interface de migração OTOBO, é possível realizar as seguintes migrações:
zh_hans: 使用OTOBO迁移界面，可以执行以下迁移：

source: A 1:1 migration on the same application server with the same database server.
pt_br: Uma migração 1:1 no mesmo servidor de aplicativos com o mesmo servidor de banco de dados.
zh_hans: 在拥有相同数据库服务器的同一个应用服务器上进行1：1迁移。

source: A streamlined migration where the source database is first copied to the target database server.
pt_br: Uma migração simplificada em que o banco de dados de origem é copiado primeiro para o servidor de banco de dados de destino.
zh_hans: 在拥有相同数据库服务器的同一个应用服务器上进行1：1迁移。

source: A general migration where many combinations are possible.
pt_br: Uma migração geral onde muitas combinações são possíveis.
zh_hans: 通常情况下的迁移可以有多种组合。

source: Change server: Migrate and simultaneously move to a new application server.
pt_br: Alterar servidor: migre e simultaneamente mova para um novo servidor de aplicativos.
zh_hans: 迁移并同时迁移到新的应用程序服务器和操作系统。

source: 2. Separate application and web servers: It's your choice whether you want to run application and database server on the same host or each on a dedictated host. This choice is regardless of the previous setup in OTRS / ((OTRS)) Community Edition.
pt_br: 2. Aplicação e servidores da web separados: é sua escolha se deseja executar o aplicativo e o servidor de banco de dados no mesmo host ou cada um em um host dedicado. Esta escolha independe da configuração anterior no OTRS / ((OTRS)) Community Edition.
zh_hans: 2. 分开的应用程序和Web服务器：您是要在同一主机上运行应用程序还是数据库服务器还是在专用主机上运行数据库服务器，这是您的选择。此选择与OTRS /（（OTRS））Community Edition中的先前设置无关。

source: Different databases: Migrate from any of the supported databases to any other one.
pt_br: Bancos de dados diferentes: migre de qualquer um dos bancos de dados suportados para qualquer outro.
zh_hans: 可以从任何系统支持的数据库迁移到任何另一个支持的数据库。

source: Different operating system: Switch from any supported operating system to any other supported operating system during migration.
pt_br: Sistema operacional diferente: mude de qualquer sistema operacional compatível para qualquer outro sistema operacional compatível durante a migração.
zh_hans: 在迁移过程中，可以从任何系统支持的操作系统切换到任何另一个支持的操作系统。

source: Docker: Migrate to a Docker-based installation of OTOBO 10.
pt_br: Docker: Migre para uma instalação baseada em Docker do OTOBO 10.
zh_hans: 可以迁移到基于Docker的OTOBO 10。

source: Migration Requirements
pt_br: Requerimentos de migração
zh_hans: 迁移的要求

source: 1. Basic requirement for a migration is that you already have an ((OTRS)) Community Edition or OTRS 6.0.\* running, and that you want to transfer configuration and data to OTOBO.
pt_br: 1. O requisito básico para uma migração é que você já tenha um ((OTRS)) Community Edition or OTRS 6.0.\* Em execução e que deseja transferir a configuração e os dados para o OTOBO.
zh_hans: 1.迁移的基本要求是，您已经在运行（（OTRS））Community Edition或OTRS 6.0。\ *，并且您希望将配置和数据传输到OTOBO。

source: Please consider carefully whether you really need the data and configuration. Experience shows that quite often a new start is the better option, as the previously used installation and configuration was rather suboptimal anyway. It might also make sense to only transfer the ticket data and to change the basic configuration to OTOBO Best Practice. We are happy to advise you, please get in touch at hello@otobo.de or ask your question in the OTOBO Community forum at https://forum.otobo.org/.
pt_br: Considere cuidadosamente se você realmente precisa dos dados e da configuração. A experiência mostra que, muitas vezes, um novo começo é a melhor opção, já que a instalação e configuração usadas anteriormente eram bastante abaixo do ideal. Também pode fazer sentido transferir apenas os dados do tíquete e alterar a configuração básica para o OTOBO Best Practice. Teremos prazer em aconselhá-lo, entre em contato pelo e-mail hello@otobo.de ou faça sua pergunta no fórum da comunidade OTOBO em https://forum.otobo.org/.
zh_hans: 请认真考虑你是否真的需要这些数据和配置。经验表明，以前使用的安装和配置都不理想，新的开始通常是更好的选择。仅传输工单数据并将基本配置更改为OTOBO Best Practice也可能有用。我们很乐意为您提供建议，请联系hello@otobo.de或在OTOBO社区论坛（https://forum.otobo.org/）上提问。

source: You need a running OTOBO installation to start the migration from there!
pt_br: Você precisa de uma instalação OTOBO em execução para iniciar a migração a partir daí!
zh_hans: 您需要一个运行中的OTOBO安装程序，才能从那里开始迁移！

source: This OTOBO installation must contain all OPM packages installed in your OTRS that you want to use in OTOBO, too.
pt_br: Essa instalação do OTOBO deve conter todos os pacotes OPM instalados no seu OTRS que você também deseja usar no OTOBO.
zh_hans: 此OTOBO安装必须还包含要在OTOBO中使用的，OTRS中安装的所有OPM软件包。

source: 4. If you are planning to migrate to another server, then the OTOBO webserver must be able to access the location where your ((OTRS)) Community Edition or OTRS 6.0.* is installed. In most cases, this is the directory */opt/otrs* on the server running OTRS. The read access can be effected via SSH or via file system mounts.
pt_br: 4. Se você está planejando migrar para outro servidor, o servidor da web OTOBO deve ser capaz de acessar o local onde seu ((OTRS)) Community Edition ou OTRS 6.0.* Está instalado. Na maioria dos casos, este é o diretório */opt/otrs* no servidor que executa o OTRS. O acesso de leitura pode ser efetuado via SSH ou via montagens do sistema de arquivos.
zh_hans: 4.如果您打算迁移到另一台服务器，那么OTOBO Web服务器必须能够访问您的（（OTRS））Community Edition或OTRS 6.0。*的安装位置。在大多数情况下，是运行OTRS的服务器上的目录/ opt / otrs。访问可以通过SSH或通过文件系统挂载来进行。此外，必须可以从运行OTOBO的服务器访问* otrs *数据库。必须为外部主机授予只读访问权限。

source: 5. The *otrs* database must be accessible from the server running OTOBO. Readonly access must be granted for external hosts. If access is not possible, or when the speed of the migration should be optimised, then a dump of the database is sufficient.
pt_br: 5. O banco de dados *otrs* deve estar acessível a partir do servidor que executa o OTOBO. O acesso somente leitura deve ser concedido para hosts externos. Se o acesso não for possível ou quando a velocidade da migração deve ser otimizada, um dump do banco de dados é suficiente.
zh_hans: 5. 必须可以从运行OTOBO的服务器访问* otrs *数据库，必须为外部主机授予只读访问权限，如果无法访问，或者应该优化迁移速度，则转储数据库就足够了。

source: If SSH and database access between the servers is not possible, please migrate OTRS to OTOBO on the same server and only then move the new installation.
pt_br: Se o acesso SSH e ao banco de dados entre ambos servidores não for possível, migre o OTRS para o OTOBO no mesmo servidor e somente então mova a nova instalação.
zh_hans: 如果无法在服务器之间进行SSH和数据库访问，请在同一台服务器上进行OTRS到OTOBO的迁移，然后再移动新安装。

source: Step 1: Install the new OTOBO System
pt_br: Passo 1: Instalação do novo Sistema OTOBO
zh_hans: 步骤 1：安装新的OTOBO系统

source: Under Apache, there are pitfalls with running two independent applications under mod_perl on the same server. These pitfalls can be alleviated with the mod_perl setting ``PerlOptions +Parent``. This setting makes sure that the applications use their own dedicated Perl interpreter. Please check your Apache config files in the directory */etc/apache2/sites-enabled* and add the setting in case it is missing.
pt_br: No Apache, existem armadilhas em executar dois aplicativos independentes em mod_perl no mesmo servidor. Essas armadilhas podem ser atenuadas com a configuração mod_perl ``PerlOptions +Parent``. Essa configuração garante que os aplicativos usem seu próprio interpretador Perl dedicado. Verifique seus arquivos de configuração do Apache no diretório */etc/apache2/sites-enabled* e adicione a configuração caso ela esteja faltando.

source: After finishing the installation tutorial, please log in to the OTOBO Admin Area ``Admin -> Packages`` to install all required OTOBO OPM packages.
pt_br: Depois de terminar o tutorial de instalação, faça o login na área de administração do OTOBO ``Admin -> Packages`` para instalar todos os pacotes OTOBO OPM necessários.
zh_hans: 完成安装教程后，请登录到OTOBO管理员区域``Admin -> Packages`` ，安装所有需要的OTOBO OPM软件包。

source: The following OPM packages and OTRS "Feature Addons" need NOT and should NOT be installed, as these features are already available in the OTOBO standard:
pt_br: Os seguintes pacotes OPM e OTRS "Feature Addons" NÃO precisa e NÃO deve ser instalado, pois esses recursos já estão disponíveis no padrão OTOBO:
zh_hans: 以下OPM软件包和OTRS“功能附加组件”不需要，也不应该安装，因为这些功能已在标准的OTOBO版本中提供了：

source: Step 2: Preparing the new OTOBO system and server
pt_br: Passo 2: Preparando o novo sistema e servidor OTOBO
zh_hans: 步骤 2：准备新的OTOBO系统和服务器

source: After installing OTOBO, please log in again to the OTOBO Admin Area ``Admin -> System Configuration`` and deactivate the config option ``SecureMode``. Then log in on the server as user ``root`` and execute the following commands:
pt_br: Após instalar o OTOBO, faça o login novamente na área de administração do OTOBO ``Admin -> System Configuration`` e desative a opção de configuração ``SecureMode``. Em seguida, faça login no servidor como usuário ``root`` e execute os seguintes comandos:
zh_hans: 安装OTOBO后，请再次登录到OTOBO管理员区域``Admin -> System Configuration``，然后停用配置选项“ SecureMode”。现在以``root''用户身份登录服务器并执行以下命令：

source: When OTOBO is running in Docker, you just need to stop the Docker container ``otobo_daemon_1``:
pt_br: Quando o OTOBO está sendo executado no Docker, você só precisa parar o contêiner do Docker ``otobo_daemon_1``:
zh_hans: 当OTOBO在Docker下运行时，就可以停止Docker容器`otobo_daemon_1``：

source: It is recommended to run a backup of the whole OTOBO system at this point. If something goes wrong during migration, you will then not have to repeat the entire installation process, but can instead import the backup for a new migration.
pt_br: É recomendável executar um backup de todo o sistema OTOBO neste momento. Se algo der errado durante a migração, você não precisará repetir todo o processo de instalação, mas poderá importar o backup para uma nova migração.
zh_hans: 建议此时运行整个OTOBO系统的备份。如果在迁移过程中出现问题，则不必重复整个安装过程，而可以导入备份以进行新的迁移。

source: We advise you to read the OTOBO :doc:`backup-restore` chapter.
pt_br: Nós aconselhamos a ler o capitulo OTOBO :doc:`backup-restore`.
zh_hans: 我们建议你阅读OTOBO：backup-restore`章节。

source: Install sshpass and rsysnc if you want to migrate OTRS from another server
pt_br: Instale sshpass e rsysnc se quiser migrar OTRS de outro servidor
zh_hans: 如果要从另一台服务器迁移OTRS，请安装sshpass和rsysnc

source: The tools ``sshpass`` and ``rsync`` are needed so we can copy files via ssh. For installing ``sshpass``, please log in on the server as user ``root`` and execute one of the following commands:
pt_br: As ferramentas ``sshpass`` e ``rsync`` são necessárias para que possamos copiar arquivos via ssh. Para instalar o ``sshpass``, faça o login no servidor como usuário `` root`` e execute um dos seguintes comandos:
zh_hans: 想要通过ssh复制文件，需要``sshpass''和``rsync''工具。要安装sshpass，请以root用户身份登录服务器并执行以下命令之一：

source: The same thing must be done for *rsync* when it isn't available yet.
pt_br: O mesmo deve ser feito para *rsync* quando ainda não está disponível.
zh_hans: 如果* rsysnc *不可用，则必须执行相同的操作。

source: Step 3a non-Docker: Preparing the OTRS / ((OTRS)) Community Edition system
pt_br: Passo 3a um ambiente sem o Docker: Preparando o sistema OTRS / ((OTRS)) Community Edition system
zh_hans: 步骤 3：准备OTRS / ((OTRS)) Community Edition系统

source: Be sure to have a valid backup of your OTRS / ((OTRS)) Community Edition system, too. Yes, we do not touch any OTRS data during the migration, but at times a wrong entry is enough to cause trouble.
pt_br: Certifique-se de ter um backup válido do seu sistema OTRS / ((OTRS)) Community Edition também. Sim, não tocamos em nenhum dado OTRS durante a migração, mas às vezes uma entrada incorreta é suficiente para causar problemas.
zh_hans: 另外，你还要确保你的OTRS /（（OTRS））Community Edition系统具备有效的备份。是的，在迁移过程中我们不会修改任何OTRS数据，但有时各种错误会造成一些麻烦。

source: Now we are ready for the migration. First of all we need to make sure that no more tickets are processed and no users log on to OTRS:
pt_br: Agora estamos prontos para a migração. Antes de tudo, precisamos garantir que nenhum ticket seja processado e que nenhum usuário efetue logon no OTRS:
zh_hans: 现在我们已准备好进行迁移。首先，我们需要确保不再处理任何工单并且没有用户登录到OTRS：

source: Please log in to the OTRS Admin Area ``Admin -> System Maintenance`` and add a new system maintenance slot for a few hours. After that, delete all agent and user sessions (``Admin -> Sessions``) and log out.
pt_br: Por favor, faça o login na área de administração OTRS ``Admin -> System Maintenance`` e adicione um novo slot de manutenção do sistema por algumas horas. Depois disso, exclua todas as sessões de agente e usuário (``Admin -> Sessions``) e faça logout.
zh_hans: 请登录到OTOBO管理员区域 ``Admin -> System Maintenance``，并插入几个小时的新系统维护。之后，删除所有话务员和用户的会话（“ Admin-> Sessions”），而后退出登陆。

source: Stop All Relevant Services and the OTRS Daemon
pt_br: Interromper todos os serviços relevantes e o Daemon OTRS
zh_hans: 停止所有相关服务和OTRS守护程序

source: Please make sure there are no running services or cron jobs.
pt_br: Certifique-se de que não haja serviços ou cron jobs em execução.
zh_hans: 请确保没有正在运行的服务或cron作业。

source: Step 3b Docker: make required data available inside container
pt_br: Passo 3b Docker: disponibilizar os dados necessários dentro do contêiner

source: In the sample commands, we assume that the user **docker_admin** is used for interacting with Docker. The Docker admin may be either the **root** user of the Docker host or a dedicated user with the required permissions.
pt_br: Nos comandos de amostra, presumimos que o usuário **docker_admin** é usado para interagir com o Docker. O administrador do Docker pode ser o usuário **root** do host do Docker ou um usuário dedicado com as permissões necessárias.
zh_hans: 下面的介绍是在假设所有需要的系统都已经安装，并且你已经有了一个工作的Docker环境。我们假设用户**root**被用来和Docker互动，请注意针对一个生产环境，需要有一个专用用户作为Docker管理员。

source: Copy */opt/otrs* into the volume *otobo_opt_otobo*
pt_br: Copie */opt/otrs* dentro do volume *otobo_opt_otobo*
zh_hans: Docker：将* / opt / otrs *复制到卷* otobo_opt_otobo *

source: In this section, we assume that the OTRS home directory */opt/otrs* is available on the Docker host.
pt_br: Nesta seção, presumimos que o diretório inicial OTRS */opt/otrs* está disponível no host Docker.
zh_hans: 在本节中，我们假设Docker主机上有* / opt / otrs *。

source: There are at least two viable possibilities:
pt_br: Existem pelo menos duas possibilidades viáveis:

source: copy */opt/otrs* into the existing volume *otobo_opt_otobo*
pt_br: copie */opt/otrs* para o volume existente *otobo_opt_otobo*
zh_hans: Docker：将* / opt / otrs *复制到卷* otobo_opt_otobo *

source: mount */opt/otrs* as an additional volume
pt_br: montar */opt/otrs* como um volume adicional
zh_hans: 挂载* / opt / otrs *作为附加卷

source: Let's concentrate on option **a.** here.
pt_br: Vamos nos concentrar na opção **a.** aqui.
zh_hans: 在这里我们集中讨论选项** a.**。

source: First we need to find out where the volume *otobo_opt_otobo* is available on the Docker host.
pt_br: Primeiro, precisamos descobrir onde o volume *otobo_opt_otobo* está disponível no host Docker.
zh_hans: 在本节中，我们假设Docker主机上有* / opt / otrs *。

source: For safe copying, we use ``rsync``. Depending on your Docker setup, the command ``rsync`` might need to be run with ``sudo``.
pt_br: Para uma cópia segura, usamos ``rsync``. Dependendo da configuração do Docker, o comando ``rsync`` pode precisar ser executado com ``sudo``.
