Repository: Monviech/otobo-doc-otobo-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: pt_br, zh_hans

source: This copied directory will be available as */opt/otobo/var/tmp/copied_otrs* within the container.
pt_br: Este diretório copiado estará disponível como */opt/otobo/var/tmp/copied_otrs* dentro do contêiner.
zh_hans: 该复制的目录应该是容器中的* / opt / otobo / tmp / otrs *。

source: Copy the otrs database schema to the containerised database server
pt_br: Copie o esquema do banco de dados otrs para o servidor de banco de dados em contêiner

source: When ``mysqldump`` is installed and a connection to the OTRS database is possible, you can create the database dump directly on the Docker host. This case is supported by the script *bin/backup.pl*.
pt_br: Quando o ``mysqldump`` é instalado e uma conexão com o banco de dados OTRS é possível, você pode criar o dump do banco de dados diretamente no host Docker. Este caso é suportado pelo script *bin/backup.pl*.

source: This requires that an OTOBO installation is available on the Docker host.
pt_br: Isso requer que uma instalação OTOBO esteja disponível no host Docker.
zh_hans: 在本节中，我们假设Docker主机上有* / opt / otrs *。

source: Alternatively, the database can be dumped on another server and be transferred to the Docker host afterwards. Here are sample commands that achieve this goal.
pt_br: Como alternativa, o banco de dados pode ser despejado em outro servidor e posteriormente transferido para o host Docker. Aqui estão exemplos de comandos que atingem esse objetivo.

source: The provided commands remove any special setup of MySQL collations. In case you need any special collations, make sure to re-add them manually.
pt_br: Os comandos fornecidos removem qualquer configuração especial de MySQL collations. Caso precise de collations especiais, certifique-se de adicioná-los novamente manualmente.

source: In order to import the dumped database, we run ``mysql`` inside the running Docker container *otobo_db_1*. Note that the password for the database root is now the password that has been set up in _.env_.
pt_br: Para importar o dump do banco de dados, executamos ``mysql`` dentro do contêiner Docker em execução *otobo_db_1*. Observe que a senha para a raiz do banco de dados agora é a senha configurada em _.env_.

source: For a quick check whether the import worked, you can run the following commands.
pt_br: Para uma verificação rápida se a importação funcionou, você pode executar os seguintes comandos.

source: The copied database will be read and altered by the database user *otobo* during the migration. Therefore, *otobo* needs to be given extensive access to the copied database.
pt_br: O banco de dados copiado será lido e alterado pelo usuário do banco de dados *otobo* durante a migração. Portanto, *otobo* precisa ter amplo acesso ao banco de dados copiado.

source: When performing the migration using the web-based migration tool, please enter the following values when prompted:
pt_br: Ao realizar a migração usando a ferramenta de migração baseada na web, insira os seguintes valores quando solicitado:

source: 'db' as the OTRS database host
pt_br: 'db' como o host do banco de dados OTRS

source: 'otobo' as the OTRS database user
pt_br: 'otobo' como o usuário do banco de dados OTRS

source: the password of the database user 'otobo' as the OTRS database user password
pt_br: a senha do usuário do banco de dados 'otobo' como a senha do usuário do banco de dados OTRS

source: 'otrs' as the OTRS database name
pt_br: 'otrs' como o nome do banco de dados OTRS

source: Step 4: Perform the Migration!
pt_br: Passo 4: Realize a migração!
zh_hans: 步骤 4：进行迁移！

source: Please use the web migration tool at http://localhost/otobo/migration.pl (replace "localhost" with your OTOBO hostname and potentially add the port) and follow the process.
pt_br: Use a ferramenta de migração da web em http://localhost/otobo/migration.pl (substitua "localhost" pelo nome de seu host OTOBO e potencialmente adicione a porta) e siga o processo.
zh_hans: 请使用http：//localhost/otobo/migration.pl上的Web迁移工具（用OTOBO主机名替换“ localhost”），然后按照此过程进行操作。

source: Sometimes, a warning is shown that the deactivation of **SecureMode** has not been detected. Please restart the webserver in this case. This forces the webserver to read in the current configuration.
pt_br: Às vezes, é mostrado um aviso de que a desativação do **SecureMode** não foi detectada. Reinicie o servidor da web neste caso. Isso força o servidor web a ler a configuração atual.

source: If OTOBO runs inside a Docker container, keep the default settings *localhost* for the OTRS server and */opt/otobo/var/tmp/copied_otrs* for the OTRS home directory. This is the path of the data that was copied in step 3b).
pt_br: Se o OTOBO for executado dentro de um contêiner do Docker, mantenha as configurações padrão *localhost* para o servidor OTRS e */opt/otobo/var/tmp/copied_otrs* para o diretório inicial OTRS. Este é o caminho dos dados que foram copiados na etapa 3b).
zh_hans: 如果OTOBO在Docker容器中运行，请为OTRS服务器指定* localhost *，指定* / opt / otobo / tmp / otrs *作为OTRS主目录。

source: The default values for OTRS database user and password are taken from *Kernel/Config.pm* in the OTRS home directory. Change the proposed settings if you are using a dedicated database user for the migration. Also change the settings when you work with a database that was copied into the *otobo_db_1* Docker container.
pt_br: Os valores padrão para usuário e senha do banco de dados OTRS são obtidos de *Kernel/Config.pm* no diretório inicial do OTRS. Altere as configurações propostas se estiver usando um usuário de banco de dados dedicado para a migração. Altere também as configurações ao trabalhar com um banco de dados que foi copiado para o contêiner *otobo_db_1* do Docker.

source: In the Docker case, a database running on the Docker host won't be reachable via ``127.0.0.1`` from within the Docker container. This means that the setting ``127.0.0.1`` won't be valid for the input field ``OTRS Server``. In that case, enter one of the alternative IP-addresses reported by the command ``hostname --all-ip-addresses`` for ``OTRS Server``.
pt_br: No caso do Docker, um banco de dados em execução no host Docker não será acessível via ``127.0.0.1`` de dentro do contêiner Docker. Isso significa que a configuração ``127.0.0.1`` não será válida para o campo de entrada ``OTRS Server``. Nesse caso, insira um dos endereços IP alternativos relatados pelo comando ``hostname --all-ip-addresses`` para o ``OTRS Server``.

source: When migrating to a new application server, or to a Docker-based installation, quite often the database cannot be accessed from the target installation. This is usually due to the fact that the otobo database user can only connect from the host the database runs on. In order to allow access anyways it is recommended to create a dedicated database user for the migration. E.g. ``CREATE USER 'otrs_migration'@'%' IDENTIFIED BY 'otrs_migration';`` and ``GRANT SELECT, SHOW VIEW ON otrs.* TO 'otrs_migration'@'%';``. This user can be dropped again after the migration: ``DROP USER 'otrs_migration'@'%'``.
pt_br: Ao migrar para um novo servidor de aplicativos ou para uma instalação baseada em Docker, muitas vezes o banco de dados não pode ser acessado a partir da instalação de destino. Isso geralmente se deve ao fato de que o usuário do banco de dados otobo só pode se conectar a partir do host em que o banco de dados é executado. Para permitir o acesso de qualquer maneira, é recomendável criar um usuário de banco de dados dedicado para a migração. Por exemplo. ``CREATE USER 'otrs_migration'@'%' IDENTIFIED BY 'otrs_migration';`` e ``GRANT SELECT, SHOW VIEW ON otrs.* TO 'otrs_migration'@'%';``. Este usuário pode ser descartado novamente após a migração: ``DROP USER 'otrs_migration'@'%'``.

source: When the migration is complete, please take your time and test the entire system. Once you have decided that the migration was successful and that you want to use OTOBO from now on, start the OTOBO Daemon:
pt_br: Quando a migração estiver concluída, não se apresse e teste todo o sistema. Depois de decidir que a migração foi bem-sucedida e que você deseja usar o OTOBO a partir de agora, inicie o Daemon OTOBO:
zh_hans: 迁移完成后，请花点时间测试整个系统。一旦确定迁移成功并且要从现在开始使用OTOBO，请启动OTOBO守护程序：

source: In the Docker case:
pt_br: No caso do Docker:
zh_hans: 在Docker情况下：

source: Step 5: After Successful Migration!
pt_br: Passo 5: Após uma migração bem-sucedida!
zh_hans: 步骤 5：成功迁移后！

source: Uninstall ``sshpass`` if you do not need it anymore.
pt_br: Desinstale *sshpass* se você não precisar mais.
zh_hans: 如果不再需要，卸载 ``sshpass``。

source: Drop the databases user dedicated to the migration if you created one.
pt_br: Elimine o usuário do banco de dados dedicado à migração, caso tenha criado um.
zh_hans: 如果你为了迁移，创建了数据库用户，现在删除它。

source: Have fun with OTOBO!
pt_br: Divirta-se com o OTOBO!
zh_hans: 享受OTOBO带来的快乐吧！

source: Step 6: Known Migration Problems
pt_br: Passo 6: Problemas conhecidos de migração
zh_hans: 步骤 6：了解迁移的问题

source: 1. Login after migration not possible
pt_br: 1. O login após a migração não é possível
zh_hans: 1. 不能迁移后登陆系统

source: During our migration tests, the browser used for the migration sometimes had problems. After restarting the browser, this problem usually was solved. With Safari it was sometimes necessary to manually delete the old OTRS session.
pt_br: Durante nossos testes de migração, o navegador usado para a migração às vezes apresentava problemas. Depois de reiniciar o navegador, esse problema geralmente era resolvido. Com o Safari, às vezes era necessário excluir manualmente a sessão antiga do OTRS.
zh_hans: 在我们的迁移测试中，用于迁移的浏览器有时会出现问题。重新启动浏览器后，通常可以解决此问题。使用Safari，有时需要手动删除旧的OTRS会话。

source: 2. Final page of the migration has a strange layout due to missing CSS files
pt_br: 2. A página final da migração tem um layout estranho devido à falta de arquivos CSS
zh_hans: 2. 由于缺少CSS文件，迁移的最终页面出现布局异常

source: This can happen when the setting ScriptAlias has a non-standard value. The migration simply substitutes otrs for otobo. This might lead to the effect that the CSS and JavaScript can no longer be retrieved in OTOBO. When that happens, please check the settings in *Kernel/Config.pm* and revert them to sane values.
pt_br: Isso pode acontecer quando a configuração ScriptAlias tem um valor não padrão. A migração simplesmente substitui otrs por otobo. Isso pode fazer com que o CSS e o JavaScript não possam mais ser recuperados no OTOBO. Quando isso acontecer, verifique as configurações em *Kernel/Config.pm* e reverta-as para os valores normais.
zh_hans: 当ScriptAlias的配置不是标准值时，可能会发生这种情况。迁移简单地用otrs代替otobo可能会导致无法在OTOBO中检索CSS和JavaScript。发生这种情况时，请检查Kernel / Config.pm中的设置并将其恢复为合理的值。

source: Step 7: Manual Migration Tasks and Changes
pt_br: Etapa 7: Tarefas de migração manual e alterações
zh_hans: 步骤 7：手工迁移的任务和修改

source: 1. Password policy rules
pt_br: 1. Regras de política de senha
zh_hans: 1. 密码策略规则

source: With OTOBO 10 a new default password policy for agent and customer users is in effect, if local authentication is used. The password policy rules can be changed in the system configuration (``PreferencesGroups###Password`` and ``CustomerPersonalPreference###Password``).
pt_br: Com o OTOBO 10, uma nova política de senha padrão para usuários de agentes e clientes entra em vigor, se a autenticação local for usada. As regras da política de senha podem ser alteradas na configuração do sistema (``PreferencesGroups###Password`` and ``CustomerPersonalPreference###Password``).
zh_hans: 如果使用本地身份验证，对于OTOBO 10，代理和客户用户的新的默认密码策略将生效。可以在系统配置（“ PreferencesGroups ### Password”和“ CustomerPersonalPreference #### Password”）中更改密码策略规则。

source: Password Policy Rule
pt_br: Regra de política de senha
zh_hans: 密码策略规则

source: Default
pt_br: Padrão
zh_hans: 默认

source: Yes
pt_br: Sim
zh_hans: 是

source: 30 days
pt_br: 30 dias
zh_hans: 30天

source: 5 days
pt_br: 5 dias
zh_hans: 5天

source: 2. Under Docker: Manually migrate cron jobs
pt_br: 2. No Docker: Migre manualmente os cron jobs

source: In a non-Docker installation of OTOBO, there is at least one cron job which checks the health of the Daemon. Under Docker, this cron job no longer exists. Furthermore, there is no cron daemon running in any of the Docker containers. This means that you have to look for an individual solution for OTRS systems with customer-specific cron jobs (e. g. backing up the database).
pt_br: Em uma instalação não Docker do OTOBO, há pelo menos um cron job que verifica a integridade do Daemon. No Docker, esse cron job não existe mais. Além disso, não há daemon cron em execução em nenhum dos contêineres do Docker. Isso significa que você deve procurar uma solução individual para sistemas OTRS com cron jobs específicos do cliente (por exemplo, backup do banco de dados).

source: Performance Tuning
pt_br: Ajuste de desempenho
zh_hans: 性能调整

source: This is a list of performance enhancing techniques for your OTOBO installation. The topics include configuration, coding, memory use, and more.
pt_br: Esta é uma lista de técnicas de aprimoramento de desempenho para sua instalação OTOBO. Os tópicos incluem configuração, codificação, uso de memória e muito mais.
zh_hans: 有一系列用于OTOBO安装的性能增强技术，包括配置，编码，内存使用等。

source: Ticket Index Module
pt_br: Módulo de Índice do Ticket
zh_hans: 工单索引模块

source: Ticket index module can be set via system configuration setting ``Ticket::IndexModule``. There are two back end modules building the index for the ticket queue view:
pt_br: O módulo de índice de tickets pode ser definido através da configuração do sistema ``Ticket::IndexModule``. Existem dois módulos de backend que constroem o índice para a Visão de filas:
zh_hans: 可以通过系统配置``Ticket :: IndexModule''设置工单索引模块，这里有两个后台模块可以为工单队列视图建立索引：

source: This is the default option, which will generate each queue view on the fly from the ticket table. You will not have performance trouble until you have about 60,000 open tickets in your system.
pt_br: Esta é a opção padrão, que gerará cada exibição de fila em tempo real a partir da tabela de tickets. Você não terá problemas de desempenho até ter cerca de 60.000 tickets abertos em seu sistema.
zh_hans: 默认选项是从工单列表动态生成队列，这样在你的系统中，未解决的工单数量不超过60,000的情况下，你不会遇到性能问题。

source: The most powerful module, should be used when you have above 80,000 open tickets. It uses an extra ``ticket_index`` table, which will be populated with keywords based on ticket data. Use the following command for generating an initial index after switching back ends:
pt_br: O módulo mais poderoso, deve ser usado quando você tiver acima de 80.000 tickets abertos. Ele usa uma tabela ``ticket_index`` extra, que será preenchida com palavras-chave com base nos dados do ticket. Use o seguinte comando para gerar um índice inicial após a alterar de back-ends:
zh_hans: 当你有80,000张以上的工单时，应使用功能更强大的模块，它使用了额外的``ticket_index``表，该表将根据工单数据提取关键字。切换回后台，使用以下命令生成初始索引：

source: Ticket Search Index
pt_br: Índice de pesquisa de tickets
zh_hans: 工单查询索引

source: OTOBO uses a special search index to perform full-text searches across fields in articles from different communication channels.
pt_br: O OTOBO usa um índice de pesquisa especial para realizar pesquisas de texto completo nos campos de artigos de diferentes canais de comunicação.
zh_hans: OTOBO使用特殊的搜索索引，对不同通信渠道的文章中的各个字段进行全文搜索。

source: To create an initial index, use this command:
pt_br: Para criar um índice inicial, use este comando:
zh_hans: 要创建初始索引，请使用以下命令：

source: Actual article indexing happens via an OTOBO daemon job in the background. While articles which were just added in the system are marked for indexing immediately, it could happen their index is available only after a few minutes.
pt_br: A indexação real do artigo ocorre por meio de um trabalho do daemon do OTOBO em segundo plano. Enquanto os artigos que acabaram de ser adicionados ao sistema são marcados para indexação imediatamente, pode acontecer que o índice esteja disponível apenas após alguns minutos.
zh_hans: 实际的文章索引是通过OTOBO守护程序在后台进行，虽然刚刚添加到系统中的文章会马上被添加初始索引标记，但可能它们的索引几分钟后才可以使用。

source: There are some options available for fine-tuning the search index:
pt_br: Existem algumas opções disponíveis para ajustar o índice de pesquisa:
zh_hans: 有一些选项可以对搜索索引进行微调：

source: Defines if archived tickets will be included in the search index (disabled by default). This is advisable to keep the index small on large systems with archived tickets. If this is enabled, archived tickets will be found by full-text searches.
pt_br: Defina se os tickets arquivados serão incluídos no índice de pesquisa (desativado por padrão). É aconselhável manter o índice pequeno em sistemas grandes com tickets arquivados. Se isso estiver ativado, os tíquetes arquivados serão encontrados em pesquisas de texto completo.
zh_hans: 确认是否将已归档的工单包括在搜索索引中（默认情况下禁用）。建议在拥有已归档工单的大型系统上，索引尽量小。如果启用此选项，将可以通过全文搜索找到已归档的工单。

source: Basic full-text index settings.
pt_br: Configurações básicas do índice de texto completo.
zh_hans: 基础全文字检索设置。

source: ``Ticket::SearchIndex::Attribute`` Setting
pt_br: Configuração ``Ticket::SearchIndex::Attribute``
zh_hans: ``Ticket::SearchIndex::Attribute`` 设置

source: Run the following command in order to generate a new index:
pt_br: Execute o seguinte comando para gerar um novo índice:
zh_hans: 运行以下命令以便生成新的索引：

source: Defines the maximum number of words which will be processed to build up the index. For example only the first 1000 words of an article body are stored in the article search index.
pt_br: Define o número máximo de palavras que serão processadas para criar o índice. Por exemplo, apenas as primeiras 1000 palavras de um corpo de artigo são armazenadas no índice de pesquisa de artigos.
zh_hans: 定义可以处理建立索引的最大单词数量，例如，文章正文中仅前1000个单词存储在文章搜索索引中。

source: ``WordLengthMin`` and ``WordLengthMax``
pt_br: ``WordLengthMin`` e ``WordLengthMax``

source: Used as word length boundaries. Only words with a length between these two values are stored in the article search index.
pt_br: Usado como limites de comprimento de palavra. Somente palavras com um comprimento entre esses dois valores são armazenadas no índice de pesquisa de artigos.
zh_hans: 字长边界，作为文章搜索索引中上下区间数值，只有在区间数据以内的单词才会存在索引中。

source: Filters based on regular expressions exclude parts of the original text from the full-text index.
pt_br: Filtros baseados em expressões regulares excluem partes do texto original do índice de texto completo.

source: ``Ticket::SearchIndex::Filters`` Setting
pt_br: Configuração ``Ticket::SearchIndex::Filters``
zh_hans: ``Ticket::SearchIndex::Filters`` 设置

source: There are three default filters defined:
pt_br: Existem três filtros padrão definidos:
zh_hans: 定义了三个默认过滤器：

source: The first filter strips out special chars like: , & < > ? " ! * | ; [ ] ( ) + $ ^ =
pt_br: O primeiro filtro remove caracteres especiais como: , & < > ? " ! * | ; [ ] ( ) + $ ^ =
zh_hans: 第一个过滤器会去除特殊字符，例如：，＆<>？ “！* |; []（）+ $ ^ =

source: The second filter strips out words which begin or end with one of following chars: ' : .
pt_br: O segundo filtro remove as palavras que começam ou terminam com um dos seguintes caracteres: ' : .
zh_hans: 第二个过滤器会去除以以下字符之一开头或结尾的单词：'：。

source: The third filter strips out words which do not contain a word character: a-z, A-Z, 0-9, _
pt_br: O terceiro filtro remove as palavras que não contêm um caractere de palavra: a-z, A-Z, 0-9, _
zh_hans: 第三个过滤器会去除不包含单词字符的单词：a-z，A-Z，0-9，_

source: English stop words for full-text index. These words will be removed from the search index.
pt_br: Palavras de parada em inglês para o índice de texto completo. Essas palavras serão removidas do índice de pesquisa.
zh_hans: 全文索引的英语停用词，这些单词将从搜索索引中删除。

source: ``Ticket::SearchIndex::StopWords###en`` Setting
pt_br: Configuração ``Ticket::SearchIndex::StopWords###en``
zh_hans: ``Ticket::SearchIndex::StopWords###en`` 设置

source: There are so-called stop-words defined for some languages. These stop-words will be skipped while creating the search index.
pt_br: Existem chamadas stop-words definidas para alguns idiomas. Essas stop-words serão ignoradas ao criar o índice de pesquisa.
zh_hans: 有些语言定义了所谓的停用词。创建搜索索引时，将跳过这些停用词。

source: If your language is not in the system configuration settings or you want to add more words, you can add them to this setting:
pt_br: Se seu idioma não estiver nas definições de configuração do sistema ou você desejar adicionar mais palavras, você poderá adicioná-las a esta configuração:
zh_hans: 如果您的语言不在系统配置设置中，或者您想添加更多单词，则可以将它们添加到此设置中：

source: Document Search
pt_br: Pesquisa de documentos
zh_hans: 文档搜索

source: OTOBO uses Elasticsearch for its document search functionality. For a good introduction into the concepts, installation and usage of Elasticsearch, please follow the `Getting Started guide <https://www.elastic.co/guide/en/elasticsearch/reference/current/getting-started.html>`__.
pt_br: O OTOBO usa o Elasticsearch para sua funcionalidade de pesquisa de documentos. Para uma boa introdução aos conceitos, instalação e uso do Elasticsearch, siga as instruções em `Getting Started guide <https://www.elastic.co/guide/en/elasticsearch/reference/current/getting-started.html>`__.
zh_hans: OTOBO使用Elasticsearch作为其文档搜索，要对Elasticsearch的概念、安装和使用进行介绍，请遵循“入门指南<https://www.elastic.co/guide/zh-cn/elasticsearch/reference/current/getting-started.html>” __ 。

source: Heap Size
pt_br: Tamanho Heap
zh_hans: 堆尺寸

source: Elasticsearch is written in Java and therefore runs in a Java Virtual Machine (JVM) on any cluster node. Such a JVM uses a part of the memory, called *heap*, which size can be configured in configuration file ``jvm.options``.
pt_br: O Elasticsearch é escrito em Java e, portanto, é executado em uma Java Virtual Machine (JVM) em qualquer nó do cluster. Essa JVM usa uma parte da memória, chamada *heap*, cujo tamanho pode ser configurado no arquivo de configuração ``jvm.options``.
zh_hans: Elasticsearch用Java编写，可以在任何群集节点上的Java虚拟机（JVM）中运行。这样的JVM使用一部分内存，称为*堆*，其大小可以在配置文件``jvm.options''中进行配置。

source: The heap minimum and maximum configurations are by default set to a value of 1 GB and can be modified with the following options:
pt_br: As configurações mínima e máxima do heap são definidas por padrão para um valor de 1 GB e podem ser modificadas com as seguintes opções:
zh_hans: 默认情况下，堆的最小和最大配置设置为1 GB，可以使用以下选项进行修改：

source: ``Xms1g``: minimum heap size.
pt_br: Tamanho mínimo de heap ``Xms1g``.
zh_hans: ``Xms1g`` ：最小堆尺寸。

source: ``Xmx1g``: maximum heap size.
pt_br: Tamanho máximo de heap ``Xms1g``.

source: If the ``Xms`` has a lower value than ``Xmx``, the JVM will resize the used heap anytime the current limit is exceeded, until the value of ``Xmx`` is reached. Such a resizing causes the service to pause until it is finished, which may decrease the speed and reactivity of the search or indexing actions. Therefore it is highly recommended to set those configurations to an equal value.
pt_br: Se o ``Xms`` tiver um valor menor que o ``Xmx``, a JVM redimensionará o heap usado sempre que o limite atual for excedido, até que o valor de ``Xmx`` seja atingido. Esse redimensionamento faz com que o serviço seja pausado até ser concluído, o que pode diminuir a velocidade e a reatividade das ações de pesquisa ou indexação. Portanto, é altamente recomendável definir essas configurações para um valor igual.
zh_hans: 如果``Xms''的值比``Xmx''的值低，那么只要超过当前限制，JVM就会调整已使用堆的大小，直到达到``Xmx''的值为止。这种调整大小会导致服务暂停直到完成为止，这可能会降低搜索或索引操作的速度和反应性。因此，强烈建议将这些配置设置为相等的值。

source: If the maximum heap size is exceeded, the related cluster node stops working and might even shutdown the service.
pt_br: Se o tamanho máximo do heap for excedido, o nó do cluster relacionado para de funcionar e pode até desligar o serviço.
zh_hans: 如果超过了堆大小的最大值，则相关的群集节点将停止工作，甚至可能关闭服务。
